{"70028":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Study of evolution illustrated by Pleistocene hominid fossils and variation in living human groups. Behavior and evolution of primates examined as they contribute to the understanding of human evolution. Required for all anthropology majors.","re":null,"com":[],"sec":[]},"70029":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"A number of different peoples are studied and a variety of approaches to the nature of the culture and to the study of specific cultures presented. Required for all anthropology majors.","re":null,"com":[],"sec":[]},"70030":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Overview of ways of learning about the human past beyond the scope of written history. Reviews development of archaeology, fundamental methods and theories, and archaeology's contribution to understanding human origins, the emergence of farming, and the origins of complex societies.","re":null,"com":[],"sec":[]},"70081":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to the methods, materials, and purposes of drawing to develop perceptual and conceptual skills through a series of assignments, providing various approaches to drawing as a tool for creative exploration. Discussions and critiques facilitate the development of critical skills. Designed for students considering the art major. Students are billed a materials fee.","re":"Enrollment restricted to pre-art, art, and history of art and visual culture majors.","com":[],"sec":[]},"70082":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to photography as an art form that explores visual ideas beginning with camera-ready use, negative development, and printing. Prepares for further work in photography or for collaboration with other media in art including computer arts and two- and three-dimensional mixed media. Critically examines photographic works while reading historical and theoretical texts. Students are billed  a materials fee.","re":"Enrollment restricted to pre-art, art, and history of art and visual culture majors.","com":[],"sec":[]},"70083":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Along with an increasing general concern to preserve our natural environment, there has been the resurgence of interest in celebrating the landscape through painting. This impulse to strengthen the bond between art and nature has provided a degree of urgency, revitalizing a tradition that had once been a simple nostalgia for a romantic and rural past. Explores the potential for meaning in outdoor painting today. Emphasis is placed on group excursions and intensive discussion that includes visiting artists. May be repeated for credit.","re":null,"com":[],"sec":[]},"70084":{"ty":"Studio","cr":"5","ge":[],"desc":"Continuation of course 30. Students explore visual ideas, directing their work toward individualized goals. Required work includes making photographic prints, reading historical and theoretical works, and examination of photographs. Students are billed a materials fee. May be repeated for credit.","re":"course 30. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70107":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"An overview of the main ideas in our current view of the universe, and how they originated. Galaxies, quasars, stars, pulsars, and planets. Intended primarily for nonscience majors interested in a one-quarter survey of classical and modern astronomy.","re":null,"com":[],"sec":[]},"70111":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Introduction to molecular biology, cell physiology, and genetics. Students cannot receive credit for this course and course 21A.","re":"course 3 or a passing score on the biology placement exam, and Chemistry 1B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70116":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to biochemistry including biochemical molecules, protein structure and function, membranes, bioenergetics, and regulation of biosynthesis. Provides students with basic essentials of modern biochemistry and the background needed for upper-division biology courses. Students who plan to do advanced work in biochemistry and molecular biology should take the Biochemistry and Molecular Biology 100 series directly. Students cannot receive credit for this course after they have completed any two courses from the Biochemistry and Molecular Biology 100A, 100B, and 100C sequence with grades of Pass, C, or better.","re":"courses 20A and 20B; and Chemistry 7 or 108A or 112A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70117":{"ty":"Laboratory","cr":"5","ge":[],"desc":"An introduction to the principles and practices of laboratory microbiology, with a substantial presentation of optical microscopy. Students are billed a materials fee.","re":"previous or concurrent enrollment in BIOL 119 is required. Enrollment restricted to biological sciences and affiliated majors, non-majors by permission of instructor.","com":[],"sec":[]},"70118":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of invertebrates and their habitats. Lecture format.","re":"courses 20A, 20B, and 20C. Course 136L must be taken concurrently. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70119":{"ty":"Laboratory","cr":"2","ge":[],"desc":"An examination of invertebrates and their habitats. Weekly laboratories or field trips. Students are billed a materials fee.","re":"courses 20A, 20B, and 20C. Course 136 must be taken concurrently. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70120":{"ty":"Lecture","cr":"5","ge":[],"desc":"A survey of cetaceans, pinnipeds, sirenians, and sea otters, including natural history, systematics, physiology, behavior, anatomy, and conservation.","re":"courses 20A, 20B, and 20C; course 138 is recommended. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70121":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of the history and mechanisms of evolutionary change. Topics include molecular evolution, natural and sexual selection, adaptation, speciation, biogeography, and macroevolution.","re":"courses 20A, 20B, 20C, and 105. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70301":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"First term of an integrated study of general chemistry. Course 1A suitable for people who have a solid background in high school chemistry. Covers a range of topics including the atomic structure of matter; molecules; chemical reactions; acids and bases; gases; and equilibria in the gas and liquid phase. Lecture: 3-1/2 hours; discussion: 1-1/4 hours. Students expected to use algebra to solve problems. Prerequisite(s): high school level chemistry.","re":null,"com":[],"sec":[]},"70302":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Second term of an integrated study of general chemistry. Coverage includes quantum mechanics, the hydrogen atom, many-electron atoms and chemical periodicity, and elementary covalent bonding. Lecture: 3-1/2 hours, discussion: 1-1/4 hours.","re":"course 1A or passing the 1B placement exam, or a preparatory chemistry course at another college or university, or a grade of 4 on the AP chemistry examination. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70303":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Third term of an integrated study of general chemistry. Coverage includes thermochemistry, thermodynamics, chemical kinetics, chemical equilibrium in solution, oxidation-reduction and electrochemistry, nuclear chemistry. Lecture: 3-1/2 hours; discussion: 1-1/4 hours.","re":"course 1B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70304":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence illustrating topics covered in courses 1B-1C, respectively, and important experimental techniques. Laboratory: 3 hours; lecture: 1-1/4 hours. Students are billed a materials fee. Course 1M offered fall and winter; 1N offered winter and spring.","re":"course 1A. Concurrent enrollment in course 1B is required. Prerequisite waived for non-UCSC students.","com":[],"sec":[{"num":"70305","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:15","end":"15:15"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"70306","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:15","end":"15:15"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"70307","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"15:30","end":"18:30"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"0"},{"num":"71508","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"15:30","end":"18:30"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"}]},"70308":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence illustrating topics covered in courses 1B-1C, respectively, and important experimental techniques. Laboratory: 3 hours; lecture: 1-1/4 hours. Students are billed a materials fee. Course 1M offered fall and winter; 1N offered winter and spring.","re":"course 1M, and course 1C or concurrent enrollment in 1C. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70309","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:15","end":"15:15"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"70310","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:15","end":"15:15"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"70311","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"15:30","end":"18:30"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"71548","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"15:30","end":"18:30"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"}]},"70312":{"ty":"Lecture","cr":"5","ge":[],"desc":"An integrated study of fundamental organic chemistry, with emphasis on materials especially relevant to the biological sciences. Students with credit for course 112A cannot receive credit for course 108A; students with credit for 112B or 112C cannot receive credit for 108B. Lecture: 3-1/2 hours, discussion: 1-1/4 hours.","re":"course 1C or 4B or a grade of 5 on the AP chemistry examination. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"71307","sec":"01A","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"11:35","end":"12:45"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71308","sec":"01B","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"13:15","end":"14:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"26"},{"num":"71309","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"13:10"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71310","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:15","end":"17:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"24"}]},"70313":{"ty":"Lecture","cr":"5","ge":[],"desc":"An integrated study of fundamental organic chemistry, with emphasis on materials especially relevant to the biological sciences. Students with credit for course 112A cannot receive credit for course 108A; students with credit for 112B or 112C cannot receive credit for 108B. Lecture: 3-1/2 hours, discussion: 1-1/4 hours.","re":"course 108A or 112A. Prerequisite waived for non-UCSC students.","com":[],"sec":[{"num":"71311","sec":"01A","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"11:35","end":"12:45"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71312","sec":"01B","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"13:15","end":"14:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71313","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"13:10"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71314","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:15","end":"17:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"}]},"70314":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory experience in organic chemistry associated with courses 108A-108B, respectively. Designed to introduce the student to the many techniques associated with organic chemistry while affording an opportunity to explore the concepts discussed in the lecture material. Laboratory: 4 hours, lecture: 1-1/4 hours. Students are billed a materials fee.","re":"courses 1C/N and 108A or concurrent enrollment. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70315","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70316","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"},{"num":"70317","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 261"}],"ins":"Palleros,D.","cap":"16"},{"num":"70318","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"71490","sec":"01E","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"}]},"70319":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory experience in organic chemistry associated with courses 108A-108B, respectively. Designed to introduce the student to the many techniques associated with organic chemistry while affording an opportunity to explore the concepts discussed in the lecture material. Laboratory: 4 hours, lecture: 1-1/4 hours. Students are billed a materials fee.","re":"courses 108A/L and 108B or concurrent enrollment. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70320","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70321","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"},{"num":"70322","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70323","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"}]},"70324":{"ty":"Independent Study","cr":"5","ge":[],"desc":"An individually supervised course with emphasis on independent research. Multiple-term course extending over two or three quarters; the grade and evaluation submitted for the final quarter apply to all previous quarters. Students submit petition to sponsoring agency; may not be repeated for credit.","re":null,"com":[],"sec":[]},"70325":{"ty":"Independent Study","cr":"5","ge":[],"desc":"An individually supervised course with emphasis on independent research. Multiple-term course extending over two or three quarters; the grade and evaluation submitted for the final quarter apply to all previous quarters. Students submit petition to sponsoring agency; may not be repeated for credit.","re":null,"com":[],"sec":[]},"70415":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"Writing by engineers and computer scientists, not to general audiences, but to engineers, engineering managers, and technical writers. Exercises include job application and resume, in-code documentation, algorithm description, naive-user documentation, library puzzle, survey article, proposal, progress report, formal technical report, and oral presentation. Offered in alternate quarters.","re":"satisfaction of Entry Level Writing and Composition requirements; Computer Science 12B or 13H or Computer Engineering 12. Enrollment restricted to School of Engineering majors.","com":[],"sec":[]},"70449":{"ty":"Lecture","cr":"5","ge":[],"desc":"Studies basic algorithms and their relationships to common abstract data types. Covers the notions of abstract data types and the distinction between an abstract data type and an implementation of that data type. The complexity analysis of common algorithms using asymptotic (big \"O\") notation is emphasized. Topics include sorting and searching techniques, basic graph algorithms, and algorithm design techniques. Abstract data types covered include priority queues, dictionaries, disjoint sets, heaps, balanced trees, and hashing. Familiarity with C, Java, and Unix is assumed.","re":"course 12B or 13H, Computer Engineering 16 or 16H, Mathematics 19B, and one course from the following: Mathematics 21, 22, 23A, 24, or Applied Mathematics and Statistics 27. Enrollment restricted to School of Engineering majors.","com":[],"sec":[]},"70551":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"For all interested students as well as prospective economics majors. Examines how markets allocate resources in different kinds of economies. Topics include competitive markets, monopoly, financial markets, income distribution, market failures, the environment, and the role of government.","re":null,"com":[],"sec":[]},"70552":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"For all interested students and prospective economics majors. Examines how the overall level of national economic activity is determined, including output, employment, and inflation. Explores the roles of monetary and fiscal policies in stabilizing the economy and promoting growth, with a focus on contemporary policy debates.","re":null,"com":[],"sec":[]},"70553":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to accounting principles and practice; preparation and analysis of financial statements; study of internal control procedures. Courses 10A and 10B satisfy the Accounting 1A-B requirement at UC Berkeley.","re":null,"com":[],"sec":[]},"70554":{"ty":"Lecture","cr":"5","ge":[],"desc":"Managerial accounting emphasizing analysis and control; accounting for corporations; introduction to taxation, budgeting, and equity/debt financing; management decision making. Courses 10A and 10B satisfy the Accounting 1A-B requirement at UC Berkeley.","re":"course 10A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70555":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"An introduction to mathematical tools and reasoning, with applications to economics. Topics are drawn from precalculus and calculus and include functions and graphs, techniques of differentiation, relative extrema, logarithms and exponents, and differentials. Students who have already taken Mathematics 11A and 19A should not take this course.","re":"score of 31 or higher on Mathematics Placement Exam. Students who do not place into precalculus should enroll in Mathematics 2. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70556":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Mathematical tools and reasoning, with applications to economics. Topics are drawn from integral calculus, multivariable calculus, and linear algebra and include definite integrals, partial derivatives, Lagrange multipliers, matrix algebra, and solving systems of linear equations.","re":"course 11A or Applied Mathematics and Statistics 11A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70559":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of resource allocation, the function of markets, consumer behavior, and the determination of price, output, and profits in competitive, monopolistic, and oligopolistic market structures. Also considers issues of welfare and public policy. Students cannot receive credit for this course and course 100M.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70560":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of income, employment, interest rates, and the price level. Examines the role of monetary and fiscal policy in economic stabilization. Also considers these issues as they relate to the global economy. Students cannot receive credit for this course and course 100N.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Course 100A is strongly recommended as preparation. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70561":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Practical methods for organizing and analyzing economic data, testing economic hypotheses, and measuring economic relationships. Regression analysis is the main empirical method, and basic statistical and probability theory is included. Students gain hands-on computer experience with an econometric software package. Students cannot receive credit for this course and Engineering 113.","re":"courses 1, 2, and either course 11B or Mathematics 22. Courses 100A or 100B strongly recommended as preparation. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70637":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Introduction to geography, geology, climate, hydrology, biotic communities, flora, wildlife, and scenic and recreational resources of the Santa Cruz mountains. Orientation in the field to the peaks, ridges, rivers, creeks, watersheds, vegetation, public lands, trail systems, and land uses of the range enables students to become familiar with natural history and ecology of the mountains.","re":null,"com":[],"sec":[]},"70638":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Covers principles of ecology including limits to species abundances, evolutionary ecology, population dynamics, community interactions and patterns, and ecosystem patterns and dynamics.","re":null,"com":[],"sec":[]},"70639":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Environmental policy issues are situated within historical developments in political and economic systems. Introduces some of the key concepts of politics and economics by way of examining the processes which have given rise to environmental issues, their social and political perception, and institutional responses.","re":null,"com":[],"sec":[]},"70654":{"ty":"Lecture","cr":"5","ge":[],"desc":"The evolution, taxonomy, physiology, behavior, ecology, and management of birds. Lecture, discussion, field format. Birds observed in habitats including bay, marsh, meadow, and forest. Evaluations based on a field journal and examinations.","re":"Courses 105 or Biology 138 are recommended. Enrollment restricted to junior and senior students.","com":[],"sec":[]},"70707":{"ty":"Independent Study","cr":"5","ge":[],"desc":"Students submit petition to sponsoring agency. May be repeated for credit.","re":null,"com":[],"sec":[]},"70722":{"ty":"Lecture","cr":"5","ge":["IH","A"],"desc":"An introduction to the basic elements, range, and diversity of cinematic representation and expression. Aesthetic, theoretical, and critical issues are explored in the context of class screenings and critical readings. Students are billed a course fee.","re":"Enrollment restricted to first-year students, sophomores, and juniors.","com":[],"sec":[{"num":"71491","sec":"01A","loct":[{"t":{"day":["Wednesday"],"time":{"start":"13:30","end":"14:40"}},"loc":"Soc Sci 2 075"}],"ins":"Campos,D.E.","cap":"14"},{"num":"71492","sec":"01B","loct":[{"t":{"day":["Wednesday"],"time":{"start":"15:00","end":"16:10"}},"loc":"Soc Sci 2 075"}],"ins":"Campos,D.E.","cap":"14"}]},"70724":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"A survey of various experimental styles and practices in film and video, addressing the historical developments of these media formats. The course situates experimental film and video work within the larger contexts of artistic traditions as well as networks of production and reception. Students are billed for a course fee.","re":"course 20A . Enrollment restricted to film and digital media majors during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"70725":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Problems in writing for film and television are explored through the writing of original material and analysis of existing works. Various film genres, conventions, and styles, both fictional and nonfictional, are examined.  Prerequisite(s): satisfaction of the Entry Level Writing and Composition requirements. Admission by application process which may begin prior to start of quarter; application materials generally available final week of preceding quarter. See enrollment conditions section in quarterly","re":null,"com":[],"sec":[]},"70751":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of the political, social, and cultural history of the U.S. from the founding of the North American colonies to 1877.  (Formerly course 25A.)","re":null,"com":[],"sec":[]},"70817":{"ty":"Lecture","cr":"5","ge":[],"desc":"Goal is to understand and apply basic rules of grammar and the sociolinguistic rules of the language needed to carry out various, simple tasks; to learn to read and write hiragana, katakana, and 40 kanji. (Formerly","re":null,"com":[],"sec":[]},"70818":{"ty":"Lecture","cr":"5","ge":[],"desc":"Goal is to understand and apply additional rules of grammar and the sociolinguistic rules of the language needed to carry out various tasks; to develop skills in reading and writing, learn to read and write 70 additional kanji. (Formerly","re":"course 1; or placement by examination. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70832":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduction to U.S. and comparative legal institutions and practices. Examines diverse areas of law from torts to civil rights to international human rights. Why is America portrayed as having an activist legal culture; why is law used to decide so many questions from presidential elections to auto accidents; can law resolve disputes that, historically, have led to war and violence; is the legal system fair and/or effective, and, if so, for whom and under what conditions?","re":null,"com":[],"sec":[]},"70833":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the status of American civil liberties as provided by the Bill of Rights. Particular attention will be given to issues of concern relating to the aftermath of 9/11, including issues relating to detainees, freedom of information requests, wiretapping authority, watch lists, profiling, and creation of a domestic intelligence agency. (Formerly course 125,","re":"Enrollment restricted to legal studies majors during priority enrollment only.","com":[],"sec":[]},"70844":{"ty":"Lecture","cr":"5","ge":["IH","W"],"desc":"Close reading and analysis of literary texts, including representative examples of several different genres and periods. An introduction to practical criticism required of all literature majors; should be completed prior to upper-division work in literature.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70893":{"ty":"Lecture","cr":"5","ge":[],"desc":"Operations on real numbers, complex numbers, polynomials, and rational expressions; exponents and radicals; solving linear and quadratic equations and inequalities; functions, algebra of functions, graphs; conic sections; mathematical models; sequences and series.","re":"placement exam score of 12 or higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70894":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Inverse functions and graphs; exponential and logorithmic functions, their graphs, and use in mathematical models of the real world; rates of change; trigonometry, trigonometric functions, and their graphs; and geometric series. Students cannot receive credit for both course 3 and Applied Mathematics and Statistics 3. Applied Mathematics and Statistics 3 can substitute for course 3.","re":"course 2 or placement exam score of 20 or higher. Prerequisite waived for non-UCSC stiudents.","com":[],"sec":[]},"70895":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Inverse functions and graphs; exponential and logorithmic functions, their graphs, and use in mathematical models of the real world; rates of change; trigonometry, trigonometric functions, and their graphs; and geometric series. Students cannot receive credit for both course 3 and Applied Mathematics and Statistics 3. Applied Mathematics and Statistics 3 can substitute for course 3.","re":"course 2 or placement exam score of 20 or higher. Prerequisite waived for non-UCSC stiudents.","com":[],"sec":[]},"70896":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"A modern course stressing conceptual understanding, relevance, and problem solving. The derivative of polynomial, exponential, and trigonometric functions of a single variable is developed and applied to a wide range of problems involving graphing, approximation, and optimization. Students cannot receive credit for both this course and course 19A or Applied Mathematics and Statistics 11A or Economics 11A.","re":"course 3 or Applied Mathematics and Statistics 3; or placement exam score of 31 or higher; or AP Calculus AB exam score of 3 or higher. Prerequisite Waived for non-UCSC students.","com":[],"sec":[]},"70897":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Starting with the fundamental theorem of calculus and related techniques, the integral of functions of a single variable is developed and applied to problems in geometry, probability, physics, and differential equations. Polynomial approximations, Taylor series, and their applications conclude the course. Students cannot receive credit for this course and course 19B, or Applied Mathematics and Statistics 11B, or Economics 11B.","re":"course 11A or AP Calculus AB exam score of 4 or 5, or BC exam score of 3 or higher, or IB Mathematics Higher Level exam score of 5 or higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70898":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"The definite integral and the fundamental theorem of calculus. Areas, volumes. Integration by parts, trigonometric substitution, and partial fractions methods. Improper integrals. Sequences, series, absolute convergence and convergence tests. Power series, Taylor and Maclaurin series. Students cannot receive credit for both this course and course 11B, Applied Math and Statistics 11B, or Economics 11B.","re":"course 19A or AP Calculus AB exam score of 4 or 5, or BC exam score of 3 or higher, or IB Mathematics Higher Level exam score of 5 of higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70899":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Systems of linear equations, matrices, determinants. Introduction to abstract vector spaces, linear transformation, inner products, geometry of Euclidean space, and eigenvalues. One quarter of college mathematics is recommended as preparation.","re":null,"com":[],"sec":[]},"70900":{"ty":"Lecture","cr":"5","ge":[],"desc":"Functions of several variables. Continuity and partial derivatives. The chain rule, gradient and directional derivative. Maxima and minima, including Lagrange multipliers. The double and triple integral and change of variables. Surface area and volumes. Applications from biology, chemistry, earth sciences, engineering, and physics. Students cannot receive credit for this course and course 23A.","re":"course 11B or 19B or 20B. Prerequisite(s): course 11B or 19B or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70901":{"ty":"Lecture","cr":"5","ge":[],"desc":"Functions of several variables. Continuity and partial derivatives. The chain rule, gradient and directional derivative. Maxima and minima, including Lagrange multipliers. The double and triple integral and change of variables. Surface area and volumes. Applications from biology, chemistry, earth sciences, engineering, and physics. Students cannot receive credit for this course and course 23A.","re":"course 11B or 19B or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70902":{"ty":"Lecture","cr":"5","ge":[],"desc":"Vectors in n-dimensional Euclidean space. The inner and cross products. The derivative of functions from n-dimensional to m-dimensional Euclidean space is studied as a linear transformation having matrix representation. Paths in 3-dimensions, arc length, vector differential calculus. Taylor's theorem in several variables, extrema of real-valued functions, constrained extrema and Lagrange multipliers, the implicit function theorem, some applications. Students cannot receive credit for this course and course 22.","re":"course 19B or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70903":{"ty":"Lecture","cr":"5","ge":[],"desc":"Double integral, changing the order of integration. Triple integrals, maps of the plane, change of variables theorem, improper double integrals. Path integrals, line integrals, parametrized surfaces, area of a surface, surface integrals. Green's theorem, Stokes theorem, conservative fields, Gauss' theorem. Applications to physics and differential equations, differential forms.","re":"course 23A. prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70904":{"ty":"Lecture","cr":"5","ge":[],"desc":"First and second order ordinary differential equations, with emphasis on the linear case. Methods of integrating factors, undetermined coefficients, variation of parameters, power series, numerical computation. Students cannot receive credit for this course and Applied Mathematics and Statistics 20.","re":"course 22 or 23A; course 21 is recommended as preparation. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70940":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"The most significant group in the history of popular music, the Beatles spanned the gamut of styles from hard-edged R & B to sophisticated art-rock. This course explores their work in detail, in its own terms, and in the historical/cultural/technological contexts. Students cannot receive credit for both this course and course 180V in the same quarter. Course 11C (formerly course 80H) is recommended but not required as preparation.","re":null,"com":[],"sec":[]},"70951":{"ty":"Lecture","cr":"5","ge":[],"desc":"The systematics, physiology, ecology, behavior, and conservation of marine birds and mammals, with emphasis on the fauna and issues of the Monterey Bay area. Lectures are complemented by laboratory and field sessions. Lab topics include taxonomy and comparative morphology. Field exercises are designed to promote development of observation and identification skills. Field trips enable students to observe unique local species in their native habitats and learn current research techniques.","re":"course 80A, Biology 20C, or permission of instructor. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70952":{"ty":"Independent Study","cr":"5","ge":[],"desc":"Students submit petition to sponsoring agency. May be repeated for credit.","re":null,"com":[],"sec":[]},"70969":{"ty":"Lecture","cr":"5","ge":["IH","Q"],"desc":"A study of correct reasoning, concentrating on developing the skills necessary to distinguish logically correct from logically incorrect arguments. The emphasis is on modern symbolic logic, although the traditional theory of the syllogism is also covered.","re":null,"com":[],"sec":[]},"70970":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An introduction to the main areas of philosophy using both classic and contemporary sources.  Focuses on central and enduring problems in philosophy such as skepticism about the external world, the mind-body problem, and the nature of morality.","re":null,"com":[],"sec":[]},"70971":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"This course is an introduction to the moral issues raised by our interactions with nonhuman animals and with the rest of the natural environment.  The course will relate traditional moral theories to contemporary literature on the ethics of nature conservation and environmental protection.  The course is intended as a first course in philosophy as well as a first course in ethics; therefore, questions concerning the nature of philosophical inquiry and the ways in which philosophical inquiry is different from inquiries conducted within other disciplines will also be addressed.","re":null,"com":[],"sec":[]},"70979":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"The physics of mechanics, wave motion, temperature, pressure, and fluids. A lecture and discussion course that provides a basic foundation of physics for students whose major interest is in biology or another science.","re":"Concurrent enrollment in PHYS 7L is required. High school algebra, geometry, and trigonometry are recommended.","com":[],"sec":[]},"70980":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"A continuation of course 7A. The physics of electricity and magnetism, optics, special relativity, quantum theory and the atom.","re":"course 7A. Concurrent enrollment in course 7M is required. Prerequisite waived for non-UCSC students","com":[],"sec":[]},"70981":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 7A. One three-hour laboratory session per week.","re":"Concurrent enrollment in PHYS 7A is required.","com":[],"sec":[]},"70982":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 7B. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 7B is required.","com":[],"sec":[]},"70983":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 7B. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 7B is required.","com":[],"sec":[]},"71049":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduces prospective majors to the scientific study of behavior and mental processes and also provides an overview for non-majors. Emphasizes social, cognitive, developmental, and personality psychology and their interrelations.","re":null,"com":[],"sec":[]},"71050":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"An introduction to elementary statistical principles and techniques relevant to psychological research. Topics covered include basic parametric and nonparametric statistics, analysis of variance, and simple factorial designs. This course is prerequisite to course 181.","re":"course 1, and Applied Mathematics and Statistics 3 or Mathematics 3 or 11A or satisfactory placement score on math placement exam or CEEB Advanced Placement Calculus AB exam. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71051":{"ty":"Lecture","cr":"7","ge":[],"desc":"An introduction to research methods used to investigate human psychology. Course emphasizes critical thinking, designing and conducting research, analyzing and interpreting data, and writing a professional research report.","re":"course 2 or Applied Mathematics and Statistics 5.  Prerequisite waived for non-UCSC students.","com":[],"sec":[{"num":"71052","sec":"01A","loct":[{"t":{"day":["Tuesday"],"time":{"start":"09:00","end":"11:00"}},"loc":"Hum & Soc Sci 350"}],"ins":"Dunn,A.L.","cap":"25"},{"num":"71053","sec":"01B","loct":[{"t":{"day":["Tuesday"],"time":{"start":"11:15","end":"13:15"}},"loc":"Hum & Soc Sci 350"}],"ins":"Dunn,A.L.","cap":"25"},{"num":"71708","sec":"01C","loct":[{"t":{"day":["Tuesday"],"time":{"start":"13:30","end":"15:30"}},"loc":"Hum & Soc Sci 350"}],"ins":"Dunn,A.L.","cap":"25"}]},"71054":{"ty":"Lecture","cr":"5","ge":[],"desc":"An analysis of contemporary research in social psychology and of what that research can teach us about the world we live in. Problems of conformity, propaganda, prejudice, attraction, and aggression. Focuses on a person's relationship with other people—how he or she influences them and is influenced by them.","re":"course 1. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71055":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on individual and relational development from early adolescence into young adulthood. Emphasis on the mutual influences of family relationships and adolescent development, and on the interface of family, peer group, and school experience in cultural contexts.","re":"courses 3 and 10. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71056":{"ty":"Lecture","cr":"5","ge":[],"desc":"Survey of theory and research on the nature of behavioral disorders. Covers psychological, biological, developmental, and socio-cultural approaches.","re":"course 1 or 60; course 60 highly recommended as preparation. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71154":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Covers field-adapted color illustration techniques including watercolor, colored pencil, inkwash, and mixed media. Field trips to various natural environments provide opportunities to sketch plants, mammals, birds, insects, landscapes, and other subject matter. In addition to in-class assignments, students produce a field sketchbook and a final project. Appropriate for students with demonstrated interest in science illustration through previous course work in science and art or through extracurricular activity in the field or a strong desire to learn the skills of the field. Enrollment process differs for Summer Session. May be repeated for credit.","re":null,"com":[],"sec":[]},"71160":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"A systematic study of social groups ranging in size from small to social institutions to entire societies. Organized around the themes of social interaction, social inequality, and social change. Fulfills lower-division major requirement.","re":null,"com":[],"sec":[]},"71161":{"ty":"Lecture","cr":"5","ge":["IS","E"],"desc":"Introduction to comparative and historical sociology. Focuses on the global integration of human society. Examines social changes such as industrialization, globalization, colonial rule, and the rise of Islamic fundamentalism. Uses social theory (including ideas from Marx, Weber, and Adam Smith) to explore the making of institutions like the nation-state, the World Trade Organization, the World Bank, and the International Monetary Fund. Fulfills lower-division major requirement.","re":null,"com":[],"sec":[]},"71162":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the interconnections between sports and society using sociological theories and methods. Topics include class, race, and gender; mass media and popular culture; political economy; education and socialization; leisure patterns (participants and spectators); globalization and cross-national comparisons.","re":null,"com":[],"sec":[]},"71226":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Challenges of performing Shakespearean and Renaissance plays are explored through confronting the acting problems they pose. Attention to verse scansion, character analysis, and textual meaning. Strategies for enacting scenes and monologues are tested in class presentations. May be repeated for credit.","re":null,"com":[],"sec":[]},"71245":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71246":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71247":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71248":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71276":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Introduction to statistical methods/reasoning, including descriptive methods, data-gathering (experimental design and sample surveys), probability, interval estimation, significance tests, one- and two-sample problems, categorical data analysis, correlation and regression. Emphasis on applications to the natural and social sciences. Students cannot receive credit for this course and course 7, and Mathematics 5 and 7.","re":null,"com":[],"sec":[]},"71277":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Introduction to statistical methods/reasoning, including descriptive methods, data-gathering (experimental design and sample surveys), probability, interval estimation, significance tests, one- and two-sample problems, categorical data analysis, correlation and regression. Emphasis on applications to the natural and social sciences. Students cannot receive credit for this course and course 7, and Mathematics 5 and 7.","re":null,"com":[],"sec":[]},"71278":{"ty":"Studio","cr":"5","ge":[],"desc":"Special studies in painting as announced. Students are billed a materials fee. May be repeated for credit.","re":"course 24. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71279":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Properties of the solar system, the sun, solar system exploration, the physical nature of the Earth and the other planets, comets and asteroids, origin of the solar system, possibility of life on other worlds, planet formation, and search for planets beyond the solar system. Intended for nonscience majors. Courses 3, 4, and 5 are independent and may be taken separately or sequentially.","re":null,"com":[],"sec":[]},"71281":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to ecology and evolution covering principles of evolution at the molecular, organismal, and population levels. Evolutionary topics include genetic and phenotypic variation, natural selection, adaptation, speciation, and macroevolution. Also covers behavioral, population, and community ecology including applied ecological issues.","re":"passing score on Biology Placement Exam or course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71282":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on physiological, behavioral, and population ecology, and on linking ecological processes to evolution. It includes basic principles, experimental approaches, concepts of modeling, and applications to ecological problems.","re":"courses 20A, 20B, and 20C. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71287":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to French language and culture with practice in all four language skills: listening, speaking, reading, and writing. Intended for students with no previous study of French.","re":null,"com":[],"sec":[]},"71291":{"ty":"Lecture","cr":"5","ge":[],"desc":"Study of representative work by Charles Dickens. Satisfies the English and Modern Literary Studies concentrations. May be repeated for credit.","re":null,"com":[],"sec":[]},"71292":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A consideration of ethical issues and theories focusing on the foundation of moral value and the principles governing character and behavior. Designed to extend and develop the student's abilities in philosophical reasoning about ethics.","re":null,"com":[],"sec":[]},"71293":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of recent movements in European thought, such as phenomenology, existentialism, hermeneutics, critical theory, continental feminism, and poststructuralism, with some attention to their 19th-century precursors. Selections from major philosophical treatises are supplemented with literary works.","re":null,"com":[],"sec":[]},"71294":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Elementary mechanics. Vectors, Newton's laws, inverse square force laws, work and energy, conservation of momentum and energy, and oscillations.","re":"Concurrent enrollment in course 6L required. Corequisite(s): Mathematics 11A or 19A or 20A or Applied Mathematics and Statistics 15A. Corequisites waived for non-UCSC students.","com":[],"sec":[]},"71298":{"ty":"Seminar","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences","A"],"desc":"Mockumentaries such as","re":null,"com":[],"sec":[]},"71300":{"ty":"Lecture","cr":"5","ge":[],"desc":"A review of methods of psychotherapy, with attention to the underlying assumptions about personality, health, and disease.","re":"course 3; course 60 or 170 recommended.","com":[],"sec":[]},"71301":{"ty":"Lecture","cr":"5","ge":[],"desc":"A healthy society requires a stable and sustainable relationship between society and nature. Covering past, present, and future, the course covers environmental history of the U.S., the variety and extent of environmental problems today, and explores their likely development in our lifetimes.","re":null,"com":[],"sec":[]},"71306":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"Introduces library and field research methods and also provides instruction and practice in writing from research, addressing issues such as voice, argument, and documentation. Students write four lengthy essays and do considerable informal writing. Course 161A is either a section for re-entry women or a section for students in the EOP Faculty Mentor Program.","re":"satisfaction of the Entry Level Writing and Composition requirements.","com":[],"sec":[]},"71315":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Introduction to applications of discrete mathematical systems. Topics include sets, functions, relations, graphs, trees, switching algebra, first order predicate calculus, mathematical induction, permutations, combinations, summation, and recurrences. Examples drawn from computer science and computer engineering.","re":"eligibility to enroll in Mathematics 19A (completion of Mathematics 2B or 3 or Mathematics Placement Exam score of 40 or higher) or completion of Mathematics 19A or 11A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71316":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71317":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71318":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"Survey of guitar history, performers, composers, repertoire, traditions, and styles—classical and non-classical—from around the world.","re":null,"com":[],"sec":[]},"71320":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching physical education. Introduces candidates to theoretical and research basis in physical education and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71321":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching physical education. Introduces candidates to theoretical and research basis in physical education and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71322":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching visual arts. Introduces candidates to theoretical and research basis for teaching visual arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71323":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching visual arts. Introduces candidates to theoretical and research basis for teaching visual arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71324":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching performing arts. Introduces candidates to theoretical and research basis for teaching performing arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71325":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching performing arts. Introduces candidates to theoretical and research basis for teaching performing arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71326":{"ty":"Lecture","cr":"5","ge":[],"desc":"Provides a theoretical and practical foundation for teaching reading within content area instruction in middle school and secondary classrooms.  Field experiences and interactive instruction will facilitate learning about strategies, curricula, methods, materials, and observation. Intended for students pursuing a single subject credential.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71327":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio. (Formerly course 285.)","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71328":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio. (Formerly course 285.)","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71329":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio. (Formerly course 285.)","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71340":{"ty":"Lecture","cr":"2","ge":[],"desc":"This course is required for prospective teachers. It provides an overview of the use of technology in the K–12 classroom. Topics covered include using the Internet and the web, building a web page, and using resources for educators on the web. Students will review software applications in a particular content area, use technology to develop lesson plans, and create integrated, thematic curricula in which technology is utilized to promote higher-order thinking, creativity, and problem-solving.","re":"Enrollment restricted to graduate students admitted to the credential program.","com":[],"sec":[]},"71341":{"ty":"Lecture","cr":"2","ge":[],"desc":"This course is required for prospective teachers. It provides an overview of the use of technology in the K–12 classroom. Topics covered include using the Internet and the web, building a web page, and using resources for educators on the web. Students will review software applications in a particular content area, use technology to develop lesson plans, and create integrated, thematic curricula in which technology is utilized to promote higher-order thinking, creativity, and problem-solving.","re":"Enrollment restricted to graduate students admitted to the credential program.","com":[],"sec":[]},"71342":{"ty":"Lecture","cr":"2","ge":[],"desc":"This course is required for prospective teachers. It provides an overview of the use of technology in the K–12 classroom. Topics covered include using the Internet and the web, building a web page, and using resources for educators on the web. Students will review software applications in a particular content area, use technology to develop lesson plans, and create integrated, thematic curricula in which technology is utilized to promote higher-order thinking, creativity, and problem-solving.","re":"Enrollment restricted to graduate students admitted to the credential program.","com":[],"sec":[]},"71343":{"ty":"Lecture","cr":"2","ge":[],"desc":"This course is required for prospective teachers. It provides an overview of the use of technology in the K–12 classroom. Topics covered include using the Internet and the web, building a web page, and using resources for educators on the web. Students will review software applications in a particular content area, use technology to develop lesson plans, and create integrated, thematic curricula in which technology is utilized to promote higher-order thinking, creativity, and problem-solving.","re":"Enrollment restricted to graduate students admitted to the credential program.","com":[],"sec":[]},"71344":{"ty":"Lecture","cr":"5","ge":[],"desc":"A sustained inquiry into the social, political, economic, and historical foundations of schools with an emphasis on community attitudes toward education. Student narratives of engagement and resistance will provide a basis for insights and interventions useful to educators.","re":"Enrollment restricted to program enrollees.","com":[],"sec":[]},"71345":{"ty":"Lecture","cr":"5","ge":[],"desc":"A sustained inquiry into the social, political, economic, and historical foundations of schools with an emphasis on community attitudes toward education. Student narratives of engagement and resistance will provide a basis for insights and interventions useful to educators.","re":"Enrollment restricted to program enrollees.","com":[],"sec":[]},"71346":{"ty":"Lecture","cr":"5","ge":[],"desc":"A sustained inquiry into the social, political, economic, and historical foundations of schools with an emphasis on community attitudes toward education. Student narratives of engagement and resistance will provide a basis for insights and interventions useful to educators.","re":"Enrollment restricted to program enrollees.","com":[],"sec":[]},"71348":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71349":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71350":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71351":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71352":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71353":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71354":{"ty":"Seminar","cr":"5","ge":[],"desc":"Seminar provides a systematic understanding of the public policy and political process in California and involves students in creating a research-based paper on some aspect of public policy and/or politics in California. Interview only: enrollment in UC Sacramento program is required. Enrollment restricted to sophomores, juniors, and seniors. May be repeated for credit.","re":null,"com":[],"sec":[]},"71355":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Provides students with a challenging opportunity to engage in experiential learning. Interview only: enrollment in UC Sacramento program is required. Enrollment restricted to sophomores, juniors, and seniors. May be repeated for credit.","re":null,"com":[],"sec":[]},"71407":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Structured off-campus learning experience providing hands-on experience and pre-professional mentoring in a variety of health-related settings. Interns are trained and supervised by a professional at their placement and receive academic guidance from their faculty sponsor. Students spend 10–12 hours per week at their placement, participate in weekly discussion meetings on campus, keep a reflective journal, and submit a final paper. Prerequisite(s): course 20L; satisfaction of the Entry Level Writing and Composition requirements; students interview with health sciences internship coordinator; applications are due one quarter in advance to the Health Sciences Internship Office. Enrollment restricted to health sciences majors. (General Education Code(s): W satisfied by taking  this course and course 130L.) May be repeated for credit.","re":null,"com":[],"sec":[]},"71408":{"ty":"Seminar","cr":"5","ge":[],"desc":"A graduate seminar on a research topic in computer engineering which varies according to instructor. Possible topics include, but are not limited to, communication networks, data compression, special-purpose architectures, computer arithmetic, software reliability and reusability, systolic arrays.","re":null,"com":[],"sec":[]},"71417":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Study and application of the theories, methods, and ethical issues involved in the practice of oral history. Critical readings and writing exercises will culminate in a 20-page oral history project.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71419":{"ty":"Studio","cr":"5","ge":[],"desc":"Continuation of the development of a basic foundation in painting with emphasis on the development of individual, experimental procedures. Students are billed a materials fee. May be repeated for credit.","re":"course 24A or 24B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71421":{"ty":"Lecture","cr":"5","ge":[],"desc":"Analysis of the theory and practice of decision making in business firms, applying the concepts and techniques of microeconomics. Topics may include pricing schemes, non-price competition, internal organization of firms, incentive contracts, asymmetric information, and game theory. Case studies are used to illustrate some topics.","re":"courses 100A or 100M, and 113. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71423":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Concentrated study of films from one cinematic grouping with similar themes and narrative structures such as westerns, musicals, or science fiction, or a comparative study of different genres. History, theory, and criticism of the genre are covered. Students are billed a course fee. May be repeated for credit.","re":"course 132A, 132B, 132C, 134A or 134B. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71424":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Concentrated study of films from one cinematic grouping with similar themes and narrative structures such as westerns, musicals, or science fiction, or a comparative study of different genres. History, theory, and criticism of the genre are covered. Students are billed a course fee. May be repeated for credit.","re":"course 132A, 132B, 132C, 134A or 134B. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71425":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the category of nonfiction through a historical and theoretical study of documentary in film and video.  Addresses ethnographic film, Soviet and Griersonian documentary, cinema verité and/or other selected documentary texts and the issues of representation they raise.  Students are billed a course fee.","re":"course 20A or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71426":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Analyzes the Latino experience in the U.S. with a special focus on strategies for economic and social empowerment. Stresses the multiplicity of the U.S. Latino community, drawing comparative lessons from Cuban-American, Puerto Rican, Chicano/Mexicano, and Central American patterns of economic participation and political mobilization.","re":null,"com":[],"sec":[]},"71427":{"ty":"Lecture","cr":"5","ge":[],"desc":"Final quarter of first-year sequence. Students complete study of French language basics, including the future tense and the conditional and the subjunctive moods, while continuing to learn about French and Francophone cultures.","re":"course 2; or placement by interview. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71430":{"ty":"Lecture","cr":"5","ge":[],"desc":"Origins and development of international law: international law is examined both as a reflection of the present world order and as a basis for transformation. Topics include jurisdiction and sovereignty, treaties, use of force, commercial law, and human rights.","re":"Enrollment restricted to legal studies majors during priority enrollment period.","com":[],"sec":[]},"71431":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An introduction to the major areas, problems, and techniques of modern linguistics.","re":null,"com":[],"sec":[]},"71433":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"The limit of a function, calculating limits, continuity, tangents, velocities, and other instantaneous rates of change. Derivatives, the chain rule, implicit differentiation, higher derivatives. Exponential functions, inverse functions, and their derivatives. The mean value theorem, monotonic functions, concavity, and points of inflection. Applied maximum and minimum problems. Students cannot receive credit for both this course and course 11A or Applied Mathematics and Statistics 11A or Economics 11A.","re":"course 3 or Applied Mathematics and Statistics 3 or placement exam score of 40 or higher or AP Calculus AB exam score of 3 or higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71434":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"An interdisciplinary introduction to oceanography focusing on biological, chemical, geological, and physical processes. Covers topics such as origins and structure of planet Earth and its oceans, co-evolution of Earth and life, plate tectonics, liquid water and the hydrologic and hydrothermal cycles, salinity and elemental cycles, ocean circulation, primary production and nutrient cycles, plankton and nekton, life on the sea floor, near shore and estuarine communities, future environmental problems our oceans face. Students may also enroll in and receive credit for Earth Sciences 1. (Note: General Education credit will not be granted for this course and Biology 80D.)","re":null,"com":[],"sec":[]},"71436":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An introduction to the main areas of philosophy using both classic and contemporary sources.  Focuses on central and enduring problems in philosophy such as skepticism about the external world, the mind-body problem, and the nature of morality.","re":null,"com":[],"sec":[]},"71438":{"ty":"Lecture","cr":"5","ge":[],"desc":"Origins and development of international law: international law is examined both as a reflection of the present world order and as a basis for transformation. Topics include jurisdiction and sovereignty, treaties, use of force, commercial law, and human rights.","re":"Enrollment restricted to politics and Latin American and Latino studies/politics majors during priority enrollment period.","com":[],"sec":[]},"71439":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines basic theories, models, methods, and research findings in human memory. Both traditional and nontraditional topics are covered. Students cannot receive credit for this course and course 130A.","re":"course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71440":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on contemporary research in the psychology of human emotions. Special attention given to work in cognitive science, including psychology, linguistics, philosophy, and anthropology, on how emotions are central to understanding human action and mental life.","re":"course 3; course 60 or 170 recommended. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71441":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines how social class shapes attitudes, beliefs, and behaviors. Emphasis is placed on structural barriers and their impact on the well-being of low-income groups. Strategies for reducing classist discrimination and improving interclass relations are discussed.","re":"Enrollment restricted to anthropology, community studies, economics, legal studies, politics, psychology, sociology, or feminist studies majors.","com":[],"sec":[]},"71443":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Exploration of nature, structure, and functionings of American society. Explores the following: social institutions and economic structure; the successes, failures, and intractabilities of institutions; general and distinctive features of American society; specific problems such as race, sex, and other inequalities; urban-rural differences. Fulfills lower-division major requirement.","re":null,"com":[],"sec":[]},"71444":{"ty":"Lecture","cr":"5","ge":[],"desc":"Historical and contemporary examination of urban life including community, race, geography, urban and suburban cultures and lifestyles, stratification, housing, crime, economic and environmental issues, demographic changes, and global urbanization.","re":"Enrollment restricted to juniors and seniors.","com":[],"sec":[]},"71448":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Students work on developing resonance, range and expressivity for stage performance via physical exercises and text explorations undertaken in small groups. Prerequisite(s): course 20. Audition required for acceptance into class.","re":null,"com":[],"sec":[]},"71449":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"A writing course examining news and feature articles in popular print media. Students write their own articles and analyze how a particular content is mandated by conventional forms, by the structure of the industries, and by ideas of \"newsworthiness.\" Designed for journalism minors and students for whom a course in media criticism is central to their program. Prerequisite(s): satisfaction of the Entry Level Writing and Composition requirements; qualifications determined by instructor at first class meeting.","re":null,"com":[],"sec":[]},"71452":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"An introductory programming course for computer science and engineering majors where students learn programming and documentation skills, as well as algorithmic problem solving and programming methodologies. Introduces students to computers, compilers, and editors, and they are expected to write medium-sized programs. Topics include, but are not limited to, procedures and functions, conditionals and loop control structures, static and dynamic memory manipulations, and text processing. Prior experience with Unix helpful, and some prior programming experience strongly recommended (e.g., course 10). This course is required for computer engineering, computer science, electrical engineering, and information systems management majors.","re":"eligibility to enroll in Mathematics 19A (Mathematics 2B or 3 or 40 or higher on mathematics placement exam) or completion of Mathematics 11A or 19A or Economics 11A or AMS 3 or 11A.  Concurrent enrollment in 12L required.","com":[],"sec":[]},"71453":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence complementing topics taught in course 12A by providing training and exposure to several software development tools and practices not covered in course 12A. In addition, the lab provides an initial exposure to a second programming language to reinforce concepts from course 12A.","re":"eligibility to enroll in Mathematics 19A (Mathematics 2B or 3 or 40 or higher on mathematics placement exam) or completion of Mathematics 11A or 19A or Economics 11A or AMS 3 or 11A.  Previous or concurrent enrollment in 12A required.","com":[],"sec":[]},"71455":{"ty":"Seminar","cr":"5","ge":[],"desc":"Surveys the rapid development of genetic engineering science and biotechnology-based industries and examines the economic, health, environmental, legal, and social justice dimensions of new biotechnology applications: genetic screening, cloning, transgenic animals and crops, genetically engineered food, and biodiversity prospecting. Readings, lectures, World Wide Web site reviews, student presentations, and papers will address controversial choices faced now by scientists, farmers, doctors, consumers, public officials, and global governance agencies. Prerequisite(s): course 25 strongly recommended.","re":null,"com":[],"sec":[]},"71456":{"ty":"Lecture","cr":"5","ge":[],"desc":"Offers systematic exploration of alternative conceptions of the nature of law, including positivism, natural law, formalism, realism, pragmatism, and theories of justice. Additional focus on the nature of law; relation of law and morality, rights and other legal concepts; and philosophical debates such as critical legal studies and critical race theory.","re":"Enrollment restricted to legal studies majors during priority enrollment only.","com":[],"sec":[]},"71457":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","E"],"desc":"An introduction to works (novels, film, autobiography, travel literature) considered in relation to life in the modern world system. Topics and contexts include colonialism, postcolonialism, transnational capitalism, migrancy, diaspora, global cities, travel, and tourism.","re":null,"com":[],"sec":[]},"71461":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Studies in the theory of cultural studies. Topic: writers of the African contemporary. Satisfies the Modern and World Literature concentrations; also satisfies the Global distribution requirement. May be repeated for credit.","re":null,"com":[],"sec":[]},"71463":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"A continuation of 6A. Wave motion in matter, including sound waves. Geometrical optics, interference and polarization, statics and dynamics of fluids. Introduction to thermodynamics, including temperature, heat, thermal conductivity, and kinetic energy.","re":"courses 5A/L or 6A/L and Mathematics 11A or 19A or 20A; concurrent enrollment in course 6M required. Corequisite: Mathematics 11B or 19B or 20B.","com":[],"sec":[]},"71464":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6B. One three-hour laboratory session per week.","re":"courses 5A/L or 6A/L; concurrent enrollment in course 6B required.","com":[],"sec":[]},"71465":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6B. One three-hour laboratory session per week.","re":"courses 5A/L or 6A/L; concurrent enrollment in course 6B required.","com":[],"sec":[]},"71466":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduces students to both mainstream theories of social movement, the critiques of these theories, and alternative ways of conceptualizing contemporary social movement and political action.","re":null,"com":[],"sec":[]},"71467":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Senior seminar that focuses on identity development in adolescence and young adulthood. Discusses theory and research on the development of personal and social identities and the sociocultural contexts in which these personal and social identities are negotiated. Satisfies seminar requirement. Satisfies senior comprehensive requirement.","re":"satisfaction of the Entry Level Writing and Composition requirements; course 102 strongly recommended. Enrollment restricted to senior psychology majors or by permission of instructor.","com":[],"sec":[]},"71470":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71471":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71472":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71473":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71474":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing.","re":"Enrollment restricted to first-year students during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"71475":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing.","re":"Enrollment restricted to first-year students during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"71476":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing.","re":"Enrollment restricted to first-year students during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"71477":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing.","re":"Enrollment restricted to first-year students during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"71478":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Explores interdisciplinary methods, theories, and practices involved in producing and reproducing knowledges about \"Africa\" and the \"West\" within global politics. Examines ideas of international relations, international political economy, development, military structures, cultural formations, and the state through the critical use of film, literature, and scholarly texts.","re":null,"com":[],"sec":[]},"71479":{"ty":"Studio","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"Theory and practice of improvisation in the performing arts with an emphasis on acting improvisation techniques. Readings and films develop a theoretical and historical understanding of spontaneous invention on stage. Students attend area theater improvisational performances.","re":null,"com":[],"sec":[]},"71482":{"ty":"Seminar","cr":"5","ge":["W","A"],"desc":"Uses writing to respond to Shakespeare Santa Cruz's summer productions. Requires frequent assignments, such as reviews, interviews, performance notes, comparisons of productions, background pieces, and reflective essays. Students regularly revise work in response to instructor and peer feedback.","re":"Satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71484":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Covers the basics of marine mammal taxonomy, anatomy, and field methods with an emphasis on local field identification and understanding of local species. Will include field trips to Long Marine Lab, Ano Nuevo, and Monterey Bay. Students are billed a materials fee.","re":"courses 20A, 20B, and 20C. Must be taken concurrently with course 139. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71486":{"ty":"Lecture","cr":"5","ge":[],"desc":"Topics in morphology, physiology, development, genetics, and endocrinology selected to exemplify current issues and perspectives in organismic biology.","re":"course 20A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71488":{"ty":"Lecture","cr":"5","ge":["IH","E"],"desc":"An introductory course to basic theories in American studies, including the U.S. in historical and transnational perspectives, social and cultural diversity and conflict in American life, and debates over concepts of national culture and citizenship.","re":null,"com":[],"sec":[]},"71489":{"ty":"Laboratory","cr":"5","ge":[],"desc":"An introduction to the principles and practices of laboratory microbiology, with a substantial presentation of optical microscopy. Students are billed a materials fee.","re":"previous or concurrent enrollment in BIOL 119 is required. Enrollment restricted to biological sciences and affiliated majors, non-majors by permission of instructor.","com":[],"sec":[]},"71497":{"ty":"Lecture","cr":"5","ge":[],"desc":"This course on special topics in ethnography will be taught on a rotating basis by various faculty members. Precise focus of each year's courses will vary according to the instructor and will be announced by the department. May be repeated for credit.","re":null,"com":[],"sec":[]},"71499":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to photography as an art form that explores visual ideas beginning with camera-ready use, negative development, and printing. Prepares for further work in photography or for collaboration with other media in art including computer arts and two- and three-dimensional mixed media. Critically examines photographic works while reading historical and theoretical texts. Students are billed  a materials fee.","re":"Enrollment restricted to pre-art, art, and history of art and visual culture majors.","com":[],"sec":[]},"71500":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71501":{"ty":"Seminar","cr":"5","ge":[],"desc":"Data collection in the field is required of all joint Ed.D. students for four quarters in the second year. Students are assigned to a faculty member who supervises data collection, liaises with district mentors, and conducts problem-solving seminars.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71519":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Structured off-campus learning experience providing hands-on experience and pre-professional mentoring in a variety of health-related settings. Interns are trained and supervised by a professional at their placement and receive academic guidance from their faculty sponsor. Students spend 10–12 hours per week at their placement, participate in weekly discussion meetings on campus, keep a reflective journal, and submit a final paper. Prerequisite(s): course 20L; satisfaction of the Entry Level Writing and Composition requirements; students interview with health sciences internship coordinator; applications are due one quarter in advance to the Health Sciences Internship Office. Enrollment restricted to health sciences majors. (General Education Code(s): W satisfied by taking  this course and course 130L.) May be repeated for credit.","re":null,"com":[],"sec":[]},"71566":{"ty":"Studio","cr":"5","ge":[],"desc":"Continuation of course 30. Students explore visual ideas, directing their work toward individualized goals. Required work includes making photographic prints, reading historical and theoretical works, and examination of photographs. Students are billed a materials fee. May be repeated for credit.","re":"course 30. Enrollment restricted to art majors.","com":[],"sec":[]},"71572":{"ty":"Lecture","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences"],"desc":"Introduces key concepts and debates in popular culture and media studies and discusses their importance in relation to American studies. Addresses these issues by examining films, television programs, musical recordings, fashion, and so on and the ways in which they are produced, distributed, marketed, and consumed.","re":null,"com":[],"sec":[]},"71573":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on the emergence and development of lesbian, gay, bisexual, and transgender (LGBT) identities in the United States from World War II to the end of the 20th Century. Functions as a foundational social, cultural, and historic introduction to the LGBT experience in the U.S.","re":null,"com":[],"sec":[]},"71574":{"ty":"Seminar","cr":"5","ge":["E"],"desc":"Introduction to the history and relevance of film and video productions within Asian America. Explores reasons why, and ways how, Asian Americans have represented themselves through the visual medium of moving pictures. Emphasis on basic tools of film analysis and appreciation.","re":null,"com":[],"sec":[]},"71575":{"ty":"Seminar","cr":"5","ge":[],"desc":"Highlights important, relevant, and topical themes in American studies and society. By closely examining one topic or theme, students connect larger issues and think across areas of study. Topics include: the prison industrial complex; radical traditions in America; race and cultural exchange; and citizenship in America. May be repeated for credit.","re":null,"com":[],"sec":[]},"71576":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Present-day values and social life of selected sub-Saharan African people examined using anthropological studies and African literature. Will be offered in the 2007–2008 academic year.","re":null,"com":[],"sec":[]},"71577":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences"],"desc":"Uses anthropological concepts and skills to critically interrogate the ways in which people and social groups are involved in creating, critiquing, and negotiating various aspects of science and technology.","re":null,"com":[],"sec":[]},"71578":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Explores several themes of relevance in contemporary India and Indian diaspora, concentrating on anthropological research and various documentary and popular Bollywood films. Through films and ethnographies, students analyze the nature of anthropological contributions to the study of Indian societies.","re":null,"com":[],"sec":[]},"71579":{"ty":"Lecture","cr":"5","ge":[],"desc":"Survey of the major forms of folklore with emphasis upon games, humor, superstitions, and folk-narratives (myth, legend, and folktales). Addresses methodological issues in folklore and theoretical approaches to the study of folklore. Will be offered in the 2007–2008 academic year.","re":"course 2. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71580":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to medium of oil painting and to painting process. Assignments develop understanding of potential of this medium as a tool for perceptual and conceptual exploration. Slide lectures introduce assignments and are basis for class discussion of contemporary and historical art activity in the field. Students are billed a materials fee. (Formerly course 24.)","re":"course 20 or 80A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71581":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Focuses on drawing from the human figure and exploring the figure for the purpose of personal expression and social communication. Intended for the intermediate/advanced drawing student. Students are billed a materials fee. May be repeated for credit.","re":"course 20. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71582":{"ty":"Studio","cr":"5","ge":["A"],"desc":"This course stresses alternative drawing processes, techniques, and materials. Intended for the intermediate or advanced student. Students are billed a materials fee. May be repeated for credit.","re":"course 20. Prerequisite waived for non-UCSC students","com":[],"sec":[]},"71583":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to drawing, processing, and printing of lithographs from stone. Emphasis on discovery of tonal, textural, and expressive potential from the surface of the stone, while establishing individual directions in imagery. Condensed history of the medium, technical theory, and critique in lecture and demonstrations. Students are billed a materials fee. May be repeated for credit.","re":"course 20. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71584":{"ty":"Studio","cr":"5","ge":[],"desc":"Continuation of course 114. Introduction of tusche wash, aluminum plates, transfers, photo-lithography (computer interface), and multiple color techniques. Emphasis on experimentation, refinement of craft and approach, defining individual imagery, and expanding scale. Further investigation of the history of the medium and contemporary practice. Students are billed a materials fee. May be repeated for credit.","re":"course 114. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71585":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Stellar evolution: observed properties of stars, internal structure of stars, stages of a star's life including stellar births, white dwarfs, supernovae, pulsars, neutron stars, and black holes. Planet and constellation identification. Intended for nonscience majors. Courses 3, 4, and 5 are independent and may be taken separately or sequentially.","re":null,"com":[],"sec":[]},"71586":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduces students to the principles of health care organizations, including how they are paid for, and examines social constructions of health care in the U.S. Key concepts include access, quality of care, and cultural competence; also features hands-on research. Recommended for health science majors and community studies majors focusing on health. Cannot receive credit for this course and course 89W.","re":null,"com":[],"sec":[]},"71587":{"ty":"Lecture","cr":"5","ge":["IS","W"],"desc":"Introduces students to the principles of health care organizations, including how they are paid for, and examines social constructions of health care in the U.S. Key concepts include access, quality of care, and cultural competence; also features hands-on research. Recommended for health science majors and community studies majors focusing on health.  Students cannot receive credit for this course and course 89. Prerequisite(s): satisfaction of the Entry Level Writing and Composition requirements; enrollment by permission of instructor at first class meeting.","re":null,"com":[],"sec":[]},"71588":{"ty":"Lecture","cr":"5","ge":[],"desc":"Mendelian and molecular genetics; mechanisms of heredity, mutation, recombination, and gene action. Students cannot receive credit for this course and course 106.","re":"courses 20A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71589":{"ty":"Lecture","cr":"5","ge":[],"desc":"Cell and molecular biology of bacteria and their viruses, including applications in medicine, public health, agriculture, and biotechnology.","re":"BIOL 100 or BIOC 100A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71590":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to social and reproductive behavior. Emphasis on studies of vertebrates in their natural habitat. Ideas concerning the evolution of social behavior, mating systems, and individual reproductive strategies. Case histories of well-studied animals that illustrate key principles in courtship and mating, parental behavior, and food-getting behavior.","re":"courses 20A, 20B, and 20C. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71591":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences"],"desc":"Examines works from various media recognized as being drawn from \"real life.\" Through film, photography, oral history, and other examples, develops critical understanding of social documentation as a process with implicit theories and conventions. Students create beginning documentaries in production collectives.","re":null,"com":[],"sec":[]},"71592":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Explores current and historical uses of music in social documentary, with primary focus on examples from film and video. Examines issues of representation, race, class, and gender through selected screenings and readings. Students develop proposals for documentary projects.","re":null,"com":[],"sec":[]},"71593":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines violence as way of maintaining existing power relations, and compares that examination to violence as a destabilizing force, undermining existing structures. Philosophy and methods of nonviolence introduced through various contemporary examples.","re":null,"com":[],"sec":[]},"71594":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Teaches students to implement common data structures and the algorithms associated with each data structure, through progressively difficult exercises. Topics include big \"O\" notation; pointers, recursion (induction), and dynamic allocation; linked lists and list processing; stacks, queues, binary trees and binary search trees; simple sorting techniques and simple search techniques. Students will gain a working knowledge of the elements of the Java and C programming languages. Prior experience with Unix is assumed.","re":"course 12A. Concurrent enrollment in course 12M required. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71595":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Complements course 12B, gaining additional competence with a number of important software development tools, languages, and techniques. Included are advanced Unix features and utilities such as grep, find, diff, the shell, and pipes; C programs utilizing I/O, arrays, pointers, and structures; a scripting language to perform simple text and file manipulation; and the make utility.","re":"courses 12A and 12L. Concurrent enrollment in course 12B required. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71596":{"ty":"Lecture","cr":"5","ge":[],"desc":"An analysis of financial policies of business enterprises. Topics include cash flow analysis, stock and bond valuation, asset pricing models, capital budgeting, financial market institutions, and financial planning.","re":"courses 10A, 100A or 100M, and 113. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71597":{"ty":"Lecture","cr":"5","ge":[],"desc":"An overview of homosexuality in American film. Explores a baseline Hollywood homophobia and the formal and historical attempts to change it. Recent independent queer film and video discussed. Topics include authorship, spectatorship, genre and genre reappropriation, historical gender constructs, the \"art\" film, mainstream vs. independent production, the relationship of film to popular music. Students are billed a course materials fee. Usually offered in alternate catalog years.","re":null,"com":[],"sec":[]},"71598":{"ty":"Seminar","cr":"5","ge":["T4-HumanitiesandArts","E"],"desc":"Examines the co-constitutive relationships of discourses of race, gender, sexuality, and the nation through a critical engagement with a range of cultural objects, including theoretical texts, film, performance, visual images, and novels. Focuses on national and transnational contexts through the lenses of feminisms, diaspora, postcoloniality, desire, labor, and state violence.","re":null,"com":[],"sec":[]},"71599":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Interdisciplinary study of Las Vegas—communities, civic structures, and commercial industry. Explores the social, political, and economic forces which have inflected urban growth and design in Las Vegas from 1900–2000.","re":null,"com":[],"sec":[]},"71600":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Examines architecture and tourism in the United States. Focuses on issues concerning recreation, technology, identity, transportation, tourism variants, ecological view on travel, and the political and social implications of tourism on a national and global economy.","re":null,"com":[],"sec":[]},"71601":{"ty":"Lecture","cr":"5","ge":["A","E"],"desc":"Introduces students to African American museums and the ideological, political, and cultural contexts shaping their development. In particular, the course considers how questions of national belonging, diasporic identity, and African American historicity surface within the practices of these institutions.","re":null,"com":[],"sec":[]},"71602":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Examines consequences of centuries of human manipulation of the natural world. The knowledge that human development has real and increasingly ascertainable limits and that these limits are, in large measure, ecological shapes how we think about the past and the world today.","re":null,"com":[],"sec":[]},"71603":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of the political, social, and cultural history of the U.S. from 1877 to the present.  (Formerly course 25B.)","re":null,"com":[],"sec":[]},"71604":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of economic, social, and political history of Europe since the late 15th century: 1914–present. A is not prerequisite to B, nor B to C. (Formerly course 30C.)","re":null,"com":[],"sec":[]},"71605":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines immigration and settlement patterns of early British immigrants to colonial North America; the large-scale immigration of the 19th Century that brought Irish, Italian, and German immigrants to the urban areas of the eastern U.S; and Chinese and Mexican immigrants who settled in the West and Southwest.","re":null,"com":[],"sec":[]},"71606":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Social, cultural, economic, and political history from the triumph of Liberalism to the present day, focusing on four key periods: the dictatorship of Porfirio Diaz (1900–1910), the armed phase of the Revolution (1910–1920), the consolidation of revolutionary programs and a \"single-party democracy\" (1920–1940), and the developmentalist counter-revolution since 1940. Provides background for understanding the Mexican diaspora to the U.S. (Formerly course 175B.)","re":null,"com":[],"sec":[]},"71607":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Explores the key issues Chinese women faced in the long 20th Century, and draws a connection between women's everyday life and bigger pictures of the state, society, revolution, nationalism, war, and economic reform.","re":null,"com":[],"sec":[]},"71608":{"ty":"Lecture","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences","E"],"desc":"Introduction to major debates and thematics in the interdisciplinary field of African diaspora studies. Explores methodological approaches to the study of \"the African diaspora;\" theoretical debates around \"racial sameness;\" and the significance of multiples vectors of difference.","re":null,"com":[],"sec":[]},"71609":{"ty":"Lecture","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences","E"],"desc":"Using the frameworks of both nation and diaspora, examines the connection of gender to the production of race, sexuality, and class with a context of globalization.","re":null,"com":[],"sec":[]},"71610":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Focuses on politics of power and resistance regarding major cross-border issues facing Latin Americans and Latinos in the 21st century. Emphasizes migration and migrant organizing; neoliberal \"free trade\" and implications for labor; organizing by women's, indigenous, and ecological movements; and for democracy and human rights. Many specific cases drawn from binational Central American experiences.","re":null,"com":[],"sec":[]},"71611":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores legal systems and legal rules around the world, for a better understanding of the factors that have shaped both legal growth and legal change. Particular attention given to differences between common and civil law systems, changes brought about by the European Union, and expansion of legal norms around the globe.","re":"Enrollment restricted to legal studies majors during priority enrollment only.","com":[],"sec":[]},"71612":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Introduction to the logical foundations of natural language semantics. Logical and semantic relations, simple set theory, logical representations (propositional and predicate calculi, modal and tense logics) and their interpretations. A basic literacy course in the language of logical representation.","re":null,"com":[],"sec":[]},"71613":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An introduction to selected modes and forms of poetry with an emphasis on close textual analysis. Examples will be taken from different historical periods and poetic traditions.","re":null,"com":[],"sec":[]},"71614":{"ty":"Seminar","cr":"5","ge":["A"],"desc":"Introduction to the crafts and techniques of poetry, fiction, and creative non-fiction, identifying and exploring traditional and non-traditional literary forms and genres while working on individual creative writing projects. An author reading and two workshop sections per week. May be repeated for credit.","re":"satisfaction of the Entry Level Writing requirement. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71615":{"ty":"Seminar","cr":"5","ge":["A"],"desc":"Introduction to the crafts and techniques of poetry, fiction, and creative non-fiction, identifying and exploring traditional and non-traditional literary forms and genres while working on individual creative writing projects. An author reading and two workshop sections per week. May be repeated for credit.","re":"satisfaction of the Entry Level Writing requirement. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71616":{"ty":"Lecture","cr":"5","ge":[],"desc":"Poets include Emily Dickinson, Walt Whitman, H.D. (Hilda Doolittle), William Carlos Williams, Marianne Moore, Wallace Stevens, Langston Hughes, T.S. Eliot, and others, with attention to leading movements and critical issues.","re":null,"com":[],"sec":[]},"71617":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Studies in the theory of cultural studies. Topic: writers of the African contemporary. Satisfies the Modern and World Literature concentrations; also satisfies the Global distribution requirement. May be repeated for credit.","re":null,"com":[],"sec":[]},"71618":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines the theory of tragedy from Aristotle to Nietzsche, while inviting students to read and discuss classic dramatic pieces to which the label \"tragedy\" was applied. Relies on student presentations and contributions, and teaches skills both in handling theory and in practical literary criticism. Satisfies the English and Pre- and Early Modern Studies literature concentrations; also satisfies the Pre- and Early Modern distribution requirement.","re":null,"com":[],"sec":[]},"71619":{"ty":"Seminar","cr":"5","ge":[],"desc":"Intensive examination of works by individual authors. Satisfies the English Literature concentration; also satisfies the Senior Seminar distribution requirement. May be repeated for credit.","re":"Literature 101. Enrollment restricted to senior literature majors.","com":[],"sec":[]},"71620":{"ty":"Lecture","cr":"5","ge":["IH","A","E"],"desc":"Designed to provide students with thorough and comprehensive background in history and roots of jazz as a musical style from its African roots to the present. Essential jazz styles and traditions are discussed through lectures, required listening, readings, lecture demonstrations, and film presentations. (Formerly course 80E,","re":null,"com":[],"sec":[]},"71621":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An examination of the conceptual and moral issues that arise in connection with such topics as abortion, racism and war and violence, world hunger, humans and their interactions with the nonhuman environment. The readings are drawn from recent philosophical articles on these topics.","re":null,"com":[],"sec":[]},"71622":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Problems about form, meaning, and interpretation in art, as found in major aesthetic theories from the philosophical tradition, and also in a variety of encounters between recent philosophy and the arts. One course in philosophy is strongly recommended prior to taking this course.","re":null,"com":[],"sec":[]},"71623":{"ty":"Lecture","cr":"5","ge":[],"desc":"Story, drama, and poetry considered as sources of philosophical perspective or as particular challenges to philosophical interpretation. Also, discussion of literary and imaginative elements in philosophical writing. One course in philosophy is strongly recommended prior to taking this course.","re":null,"com":[],"sec":[]},"71624":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Introduction to electricity and magnetism. Electromagnetic radiation, Maxwell's equations.","re":"courses 6A/L or 5A/L, and Mathematics 11B or 19B or 20B; concurrent enrollment in course 6N required. Corequisite: Math 22 or 23A suggested.","com":[],"sec":[]},"71625":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Systematic introduction to the nature of politics and government, organized around the dynamic relationship between power, principle, and process in democratic politics. Provides historic and contemporary overview; explores the interactions among government, laws, and societies at the national and international levels. (Formerly","re":null,"com":[],"sec":[]},"71626":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Explores intellectual and empirical trends shaping the U.S. relationship with the global economy. Traces debates about liberalism and interventionism, surveys post-war American foreign economic policy and discusses varieties of capitalism emerging around the world.","re":null,"com":[],"sec":[]},"71627":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Analysis of the development and operation of American political institutions, focusing on the constitutional powers of the Congress, presidency, and Supreme Court; and the evolution of the American system of political parties. Topics include the ideological underpinnings of American democracy; the changing balance of power between the executive, legislative, and judicial branches; the expansion of national government power; the expansion of the right to vote and political representation; and the rising power of \"non-governmental\" forces.","re":null,"com":[],"sec":[]},"71628":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Can common global interest prevail against particular sovereign desires? Surveys selected contemporary issues in global politics such as wars of intervention, ethnic conflict, globalization, global environmental protection, and some of the different ways in which they are understood and explained.","re":null,"com":[],"sec":[]},"71629":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores legal systems and legal rules around the world, for a better understanding of the factors that have shaped both legal growth and legal change. Particular attention given to differences between common and civil law systems, changes brought about by the European Union, and expansion of legal norms around the globe.","re":"Enrollment restricted to politics and Latin American and Latino studies/politics combined majors during priority enrollment only.","com":[],"sec":[]},"71630":{"ty":"Lecture","cr":"5","ge":[],"desc":"Psychological development from birth to adolescence, with primary emphasis on infancy and childhood. A broad introduction to the nature of change during childhood and adolescence and to theories of development.","re":"course 1. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71631":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduces basic concepts in cognitive psychology. Topics include thinking, consciousness, perceiving, language, remembering, reasoning, problem solving, and decision-making.","re":"course 1. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71632":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of contemporary theory and research on social and emotional development from infancy through childhood.","re":"courses 3 and 10. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71633":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on behavioral and brain manifestations of deception. Topics include developmental changes that allow us to understand and to use deception, physical implications of lying expressed in the face, voice, posture, and brain activity. Also covers mechanical or behavioral techniques used in deceptive behavior, whether in the form of overt behavior or brain activity.","re":"course 3; course 20 or any upper-division cognitive course strongly recommended. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71634":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines contemporary theories, findings, and social issues regarding the psychology of women. Emphasis is placed on understanding how gender, class, race, ethnicity, and sexuality shape women's experiences across the lifespan. Students cannot receive credit for this course and course 41. (Formerly","re":"Enrollment restricted to junior and senior psychology, feminist studies, sociology, and community studies majors.","com":[],"sec":[]},"71635":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Intensive instruction in colored pencil, watercolor, and mixed media. Emphasis on keen observational skills, mastery of color concepts, as well as communication of accurate information through color illustration. Appropriate for students with a demonstrated interest in science illustration through previous course work in science and art, or through extracurricular activity in the field, or a strong desire to learn the skills of the field. Enrollment process differs for Summer Session. May be repeated for credit.","re":null,"com":[],"sec":[]},"71636":{"ty":"Lecture","cr":"5","ge":[],"desc":"Considers the role of popular music as a site of contemporary social practices and cultural politics. Examines the institutional organization and production of popular music, its cultural meanings, and its social uses by different communities and social formations. Also examines popular music as a vehicle through which major cultural and political debates about identity, sexuality, community, and politics are staged and performed.","re":"course 105A or 105B. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71637":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the history of the use and abuse of consciousness-altering substances like alcohol and other drugs. Social-psychological theories of addiction are reviewed in tandem with political-economic analyses to identify the social conditions under which the cultural practices involved in drug use come to be defined as public problems. An introductory sociology course is recommended prior to taking this course.","re":null,"com":[],"sec":[]},"71638":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines the hidden politics of popular pleasure and the terrain of the popular, not solely analyses of media. Examines popular cultural products or representations, and practices. Focuses on the relationship of domination and resistance to both cultural production and consumption, and considers the terrain of the popular as key site for the reproduction of structures of inequality and how hegemonic discourses rend the politics of resistance invisible.","re":"Enrollment restricted to juniors and seniors.","com":[],"sec":[]},"71639":{"ty":"Lecture","cr":"5","ge":[],"desc":"Concerns the routine and taken-for-granted activities that make up our interactions with one another, consisting in large part—but not exclusively—of verbal exchanges. Emphasis on the socially situated character of communication, whether intimacy between two people or dominance of a group.","re":"An introductory sociology course is recommended prior to taking this course. Enrollment restricted to sophomores, juniors, and seniors.","com":[],"sec":[]},"71640":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores histories of U.S. mass education; theories of identity and educational inequality; and popular representations of schools. Considers current educational conditions in California, as well as the potential role of schools in social justice struggles.","re":null,"com":[],"sec":[]},"71641":{"ty":"Lecture","cr":"5","ge":[],"desc":"Views \"problems\" in society not as given but as social constructs. Examines the ways in which conditions in society become identified and defined as problems and consequences that follow from such a process.","re":null,"com":[],"sec":[]},"71642":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores intersections of popular culture and public spaces; how public spaces structure our lives and experiences, and how we interact with and come to understand popular culture; and how social histories, customs, and values influence the creation and maintenance of public spaces.","re":null,"com":[],"sec":[]},"71643":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"Spanish Placement Examination score of 10. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71644":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"course 1 or Spanish Placement Examination score of 20. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71645":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Includes comprehensive grammar review, composition, readings, and discussion. Reading and audiovisual material deal with various socio-political and cultural issues in the Spanish speaking world. Classes are conducted in Spanish.","re":"course 4, 4X, or Spanish Placement Examination score of 50. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71646":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Students learn vocabulary, expressions, and cultural background to be able to interact with Spanish-speaking patients and doctors. Medical Spanish fulfills language requirement for the health science major of the Biology Department.","re":"course 4; Spanish for Spanish Speakers 61, 62, 63, or 125; or Spanish Placement Examination score of 50 or higher. Enrollment restricted to health sciences majors.","com":[],"sec":[]},"71647":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Increases oral and written proficiency using authentic reading materials which focus on such topics as social class, ethnicity, education, religion, economic, and political developments in the Spanish-speaking world.","re":"course 5, 5M, 5X, or Spanish Placement Examination score of 60. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71648":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"course 1 or Spanish Placement Examination score of 20. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71649":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"course 2, 2X, or Spanish Placement Examination score of 30. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71650":{"ty":"Lecture","cr":"5","ge":[],"desc":"Develops oral fluency and cultural awareness, emphasizing speaking and understanding Spanish in everyday situations common to Latin America. This is the third course in a 2-3-13 series taught in Summer Session.","re":"course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71651":{"ty":"Seminar","cr":"5","ge":["IH"],"desc":"Includes comprehensive grammar review, composition, readings, and discussion. Reading and audiovisual material deal with various sociopolitical and cultural issues in the Spanish speaking world. Classes are conducted in Spanish.","re":"course 3, 3T, 3X, or Spanish Placement Examination score of 40. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71652":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Includes comprehensive grammar review, composition, readings, and discussion. Reading and audiovisual material deal with various socio-political and cultural issues in the Spanish speaking world. Classes are conducted in Spanish.","re":"course 4, 4X, or Spanish Placement Examination score of 50. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71653":{"ty":"Lecture","cr":"5","ge":[],"desc":"Develops oral fluency and cultural awareness, emphasizing speaking and understanding Spanish in everyday situations common to Latin America. Prerequisite(s): acceptance into Summer Session's 4-5-15 series.","re":null,"com":[],"sec":[]},"71654":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71655":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71656":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing.","re":"Enrollment restricted to first-year students during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"71657":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"A composition course for students who, having mastered basic writing skills, wish to concentrate on increasing their effectiveness as rhetoricians, prose stylists, and editors.  Assignments include writing and revising essays, responding to other students' work, and reading published essays. May be repeated for credit.","re":"satisfaction of the Entry Level Writing and Composition requirements.","com":[],"sec":[]},"71658":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Case-study-based introduction to statistical methods as practiced in the biological and environmental sciences. Descriptive methods, experimental design, probability, interval estimation, hypothesis testing, one- and two-sample problems, power and sample size calculations, simple correlation and simple linear regression, one-way analysis of variance, categorical data analysis.","re":"score of 40 or higher on mathematics placement exam, course 3, 11A, Mathematics 3, 11A, 19A or by permission of instructor. Concurrent enrollment in course 7L is required. Prerequisites and restrictions waived for non-UCSC students.","com":[],"sec":[]},"71659":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Computer-based laboratory course in which students gain hands-on experience in analysis of data sets arising from statistical problem-solving in the biological and environmental health sciences. Descriptive methods, interval estimation, hypothesis testing, one-and two-sample problems, correlation and regression, one-way analysis of variance, categorical data analysis.","re":"score of 40 or higher on mathematics placement exam, course 3, 11A, Mathematics 3, 11A, 19A, or by permission of instructor. Concurrent enrollment in course 7 is required. Prerequisites and restrictions waived for non-UCSC students.","com":[],"sec":[{"num":"71660","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"10:30","end":"12:00"}},"loc":"Soc Sci 1 135"}],"ins":"Staff","cap":"999"}]},"71661":{"ty":"Laboratory","cr":"5","ge":[],"desc":"A genetics laboratory course using the nematode","re":"courses 20A and 105. Enrollment restricted to biological sciences and affiliated majors, non-majors by permission of instructor.","com":[],"sec":[]},"71662":{"ty":"Lecture","cr":"5","ge":[],"desc":"Principles and concepts underlying the function of tissues and organ systems in animals with emphasis on vertebrate systems. Students cannot receive credit for this course and course 130.","re":"courses 20A, 20B, and 20C. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71663":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Experiments conducted with primary focus on quantitative physiological principles of organ systems and intact organisms. Students cannot receive credit for this course and course 130L. Students are billed a materials fee.","re":"BIOL 20A, BIOE 20B, and BIOE 20C. Concurrent enrollment in BIOE 131 is required. Prerequisite(s): courses 20A, 20B, and 20C. Concurrent enrollment in course 131 is required. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71664":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Trains students in the techniques of documentary film making. Through lectures, demonstrations, hands-on instruction, and review of students' work in progress, students learn the fundamentals of film/video pre-production, production, and post-production skills.","re":"Concurrent enrollment in course 80L required.","com":[],"sec":[]},"71665":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Provides students with photography skills. Through lecture, demonstration, hands-on experience, and field sessions, students acquire technical and aesthetic training in basic darkroom skills, methods of photographing people, an introduction to alternative processes, and presentation of finished photographs.","re":"Concurrent enrollment in course 80L required.","com":[],"sec":[]},"71666":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Trains students in the fundamental techniques of documentary audio production. Through lectures, documentary examples, demonstrations, hands-on instruction, and consultation with students regarding their work in progress, students gain the skills they need to produce their own audio documentaries.","re":"Concurrent enrollment in course 80L required.","com":[],"sec":[]},"71667":{"ty":"Lecture","cr":"5","ge":["T7-NaturalSciencesorSocialSciences"],"desc":"Focuses on the creation and management of technology start-ups and small companies, using case studies and team projects as the basis for learning and applying the course materials.","re":null,"com":[],"sec":[]},"71668":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","E"],"desc":"Examines films by Eisenstein, Tarkovsky, Sokurov, and other Russian directors working in the auteur tradition. Discussion of the cultural contexts and the figure of the film author in Russia. Each offering of the course focuses on a specific theme. Taught in English. Students may not receive credit for this course and Russian 106. May be repeated for credit.","re":null,"com":[],"sec":[]},"71669":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 7A. One three-hour laboratory session per week.","re":"Concurrent enrollment in PHYS 7A is required.","com":[],"sec":[]},"71670":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Examines films by Eisenstein, Tarkovsky, Sokurov, and other Russian directors working in the auteur tradition. Taught in English with a weekly discussion section in Russian. Readings in English and Russian, with writing, script analysis, cultural commentary, and other assignments in Russian.  Students may not receive credit for this course and Languages 80G. May be repeated for credit.","re":"Russian 6, or permission of instructor. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71671":{"ty":"Lecture","cr":"5","ge":[],"desc":"A broad survey of Spanish cultural topics, including history, politics, religions, art forms, music, and films. It is based on extensive conversations, discussion, and composition. Particular emphasis is placed on key changes that have occurred during the 20th century in Spain. Classes conducted through commentary on texts read (or viewed), oral presentations, and debate. Recommended for students preparing to go to Spain with EAP.","re":"course 6, 56, Spanish for Spanish Speakers 63, or Spanish Placement Examination score of 70. Enrollment restricted to language studies, Latin American and Latino studies, and literature majors.","com":[],"sec":[]},"71672":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"course 2, 2X, or Spanish Placement Examination score of 30. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71673":{"ty":"Seminar","cr":"5","ge":["IH"],"desc":"Includes comprehensive grammar review, composition, readings, and discussion. Reading and audiovisual material deal with various sociopolitical and cultural issues in the Spanish speaking world. Classes are conducted in Spanish.","re":"course 3, 3T, 3X, or Spanish Placement Examination score of 40. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71674":{"ty":"Lecture","cr":"5","ge":[],"desc":"Develops oral fluency and cultural awareness, emphasizing speaking and understanding Spanish in everyday situations common to Latin America. This is the third course in a 3-4-14 series taught in Summer Session.","re":"course 4. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71675":{"ty":"Lecture","cr":"5","ge":[],"desc":"A non-survey course suitable for people who have not had biology. A historical and experimental approach covers five key biological concepts: homeostasis, the integration of structure and function, cell theory, the mechanism of heredity, and evolution. Students cannot receive credit for this course after receiving prior credit for course 20A, 20B, or 20C.","re":"completion of biology placement exam. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71676":{"ty":"Seminar","cr":"5","ge":[],"desc":"Examines gender and sexuality in wartime and in militarized societies, women's positioning and organizing in different \"war zones\" as mothers, and warriors and traitors. Focuses on dilemmas of feminist peace politics, queer coalitions and transnational anti-war organizing, primarily in the Middle East, with particular emphasis on Palestine/Israel.","re":"Enrollment restricted to sophomores, juniors, and seniors.","com":[],"sec":[]},"71677":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Traces the history of immigration to the United States with emphasis on the 19th and early 20th centuries. Examines the causes and contexts of large-scale immigration; the similarities and differences in immigration and settlement patterns of different immigrant groups; how the process of immigration has been complicated by issues of race, ethnicity, gender, and class; and the ways in which U.S. immigration policy has influenced American's ideas of citizenship and freedom. (Formerly course 123).","re":null,"com":[],"sec":[]},"71678":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines variety of topics in constitutional law that are not covered in courses 111A and 111B. Focuses primarily on Supreme Court decisions and common-law debates.","re":"Enrollment restricted to legal studies majors during priority enrollment.","com":[],"sec":[]},"71679":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines the genre of detective fiction and the theoretical, critical, and cultural issues with which it engages. Includes 19th-century canonical works and 20th-century incarnations, including the hard-boiled detective hero (both male and female), the metaphysical detective story, and the contemporary vogue in forensic procedurals. Satisfies the English and Modern Literature concentrations.","re":null,"com":[],"sec":[]},"71680":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines narrative texts concerned with the construction of queer subjectivity from the early modern period in France and Italy, and the United States in the 20th century. Includes key texts in queer studies, and charts the development of queer theory. Satisfies the Pre- and Early Modern Studies Literature concentration; also satisfies the Pre- and Early Modern distribution requirement.","re":null,"com":[],"sec":[]},"71681":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6C. One three-hour laboratory session per week.","re":"courses 6A/L or 5A/L; concurrent enrollment in course 6C required; courses 6B/M are suggested.","com":[],"sec":[]},"71682":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6C. One three-hour laboratory session per week.","re":"courses 6A/L or 5A/L; concurrent enrollment in course 6C required; courses 6B/M are suggested.","com":[],"sec":[]},"71683":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Explores contemporary theories, findings, and social issues regarding the psychology of women. Emphasis is placed on understanding how gender role socialization influences women's beliefs and behaviors across the lifespan. Topics include achievement, intimate relationships, motherhood, mental health, violence against women, and empowerment. Students cannot receive credit for this course and course 140G.","re":null,"com":[],"sec":[]},"71684":{"ty":"Lecture","cr":"5","ge":[],"desc":"The psychology of human cognitive processes including attention, motor control, visual processing, memory, categorization, language, and perception. Focuses on the question of how knowledge about the world is represented in our minds and how those representations influence our behavior.","re":"course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71685":{"ty":"Lecture","cr":"5","ge":[],"desc":"","re":null,"com":[],"sec":[]},"71686":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Introduction to applications of discrete mathematical systems. Topics include sets, functions, relations, graphs, trees, switching algebra, first order predicate calculus, mathematical induction, permutations, combinations, summation, and recurrences. Examples drawn from computer science and computer engineering.","re":"eligibility to enroll in Mathematics 19A (completion of Mathematics 2B or 3 or Mathematics Placement Exam score of 40 or higher) or completion of Mathematics 19A or 11A.","com":[],"sec":[]},"71687":{"ty":"Lecture","cr":"5","ge":[],"desc":"Studies basic algorithms and their relationships to common abstract data types. Covers the notions of abstract data types and the distinction between an abstract data type and an implementation of that data type. The complexity analysis of common algorithms using asymptotic (big \"O\") notation is emphasized. Topics include sorting and searching techniques, basic graph algorithms, and algorithm design techniques. Abstract data types covered include priority queues, dictionaries, disjoint sets, heaps, balanced trees, and hashing. Familiarity with C, Java, and Unix is assumed.","re":"course 12B or 13H, Computer Engineering 16 or 16H, Mathematics 19B, and one course from the following: Mathematics 21, 22, 23A, 24, or Applied Mathematics and Statistics 27. Enrollment restricted to School of Engineering majors.","com":[],"sec":[]},"71688":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of resource allocation, the function of markets, consumer behavior, and the determination of price, output, and profits in competitive, monopolistic, and oligopolistic market structures. Also considers issues of welfare and public policy. Students cannot receive credit for this course and course 100M.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71689":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of income, employment, interest rates, and the price level. Examines the role of monetary and fiscal policy in economic stabilization. Also considers these issues as they relate to the global economy. Students cannot receive credit for this course and course 100N.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Course 100A is strongly recommended as preparation. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71690":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Introduces students to the dilemmas of science-based environmental policy and discusses their underlying philosophical underpinnings. Explores emergent alternatives, such as the precautionary principle and alternatives assessment, and examines the relationship between experts and the lay public in public controversies.","re":"satisfaction of the Entry Level Writing and Composition requirements.","com":[],"sec":[]},"71691":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Focuses on pleasures and horrors of getting old. Explores cultural and personal fears and then examines the social realities, which are, at once, worse than and not nearly as bad as you might think.","re":null,"com":[],"sec":[]},"71692":{"ty":"Seminar","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Examines contemporary social movements in Latin America, especially those that arose from popular response to different forms of social exclusion and to authoritarian political systems. Explores a variety of popular movements, their successes and setbacks, including rural and urban uprisings, native nations and their descendants, women, African descendants, labor, environmental and grassroots movements.","re":null,"com":[],"sec":[]},"71693":{"ty":"Lecture","cr":"5","ge":[],"desc":"Survey of theory and research on the nature of behavioral disorders. Covers psychological, biological, developmental, and socio-cultural approaches.","re":"course 1 or 60; course 60 highly recommended as preparation. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71694":{"ty":"Lecture","cr":"2","ge":[],"desc":"Reviews issues of literacy and writing in secondary content areas. Students write in several genre and prepare lesson plans for teaching writing within the discourse of their respective curricular area.","re":"Enrollment restricted to education graduate students.","com":[],"sec":[]},"71695":{"ty":"Lecture","cr":"2","ge":[],"desc":"Addresses the preparation of teachers for creating a supportive, healthy environment for student learning. Covers topics related to physical, emotional, and social health.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71696":{"ty":"Lecture","cr":"2","ge":[],"desc":"Addresses the preparation of teachers for creating a supportive, healthy environment for student learning. Covers topics related to physical, emotional, and social health.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71697":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71698":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71699":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71700":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71701":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71702":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to computational linguistics for engineers with a focus on providing background and skills in linguistics. Students are expected to already have programming skills and basic computer science. Knowledge of shell scripting or a scripting language suggested.","re":"Computer Science 10 and 12A, or permission of instructor. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71703":{"ty":"Independent Study","cr":"5","ge":[],"desc":"","re":null,"com":[],"sec":[]},"71704":{"ty":"Field Indep Study","cr":"2","ge":[],"desc":"Supervised off-campus fieldwork experience in an area connected with economics or business. Prerequisite(s): permission of instructor; students submit petition to sponsoring agency.","re":null,"com":[],"sec":[]},"71705":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71709":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71710":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71711":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing.","re":"Enrollment restricted to first-year students during priority enrollment; may be opened if space allows.","com":[],"sec":[]},"71712":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71713":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71714":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71715":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71716":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71717":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71845":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Introduction to statistical methods/reasoning, including descriptive methods, data-gathering (experimental design and sample surveys), probability, interval estimation, significance tests, one- and two-sample problems, categorical data analysis, correlation and regression. Emphasis on applications to the natural and social sciences. Students cannot receive credit for this course and course 7, and Mathematics 5 and 7.","re":null,"com":[],"sec":[]}}