{"70028":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Study of evolution illustrated by Pleistocene hominid fossils and variation in living human groups. Behavior and evolution of primates examined as they contribute to the understanding of human evolution. Required for all anthropology majors.","re":null,"com":[],"sec":[]},"70029":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"A number of different peoples are studied and a variety of approaches to the nature of the culture and to the study of specific cultures presented. Required for all anthropology majors.","re":null,"com":[],"sec":[]},"70030":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Overview of ways of learning about the human past beyond the scope of written history. Reviews development of archaeology, fundamental methods and theories, and archaeology's contribution to understanding human origins, the emergence of farming, and the origins of complex societies.","re":null,"com":[],"sec":[]},"70080":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to the methods, materials, and purposes of drawing to develop perceptual and conceptual skills through a series of assignments, providing various approaches to drawing as a tool for creative exploration. Discussions and critiques facilitate the development of critical skills. Designed for students considering the art major. Students are billed a materials fee.","re":".","com":[],"sec":[]},"70081":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to photography as an art form that explores visual ideas beginning with camera-ready use, negative development, and printing. Prepares for further work in photography or for collaboration with other media in art including computer arts and two- and three-dimensional mixed media. Critically examines photographic works while reading historical and theoretical texts. Students are billed  a materials fee.","re":".","com":[],"sec":[]},"70106":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"An overview of the main ideas in our current view of the universe, and how they originated. Galaxies, quasars, stars, pulsars, and planets. Intended primarily for nonscience majors interested in a one-quarter survey of classical and modern astronomy.","re":null,"com":[],"sec":[]},"70115":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to biochemistry including biochemical molecules, protein structure and function, membranes, bioenergetics, and regulation of biosynthesis. Provides students with basic essentials of modern biochemistry and the background needed for upper-division biology courses. Students who plan to do advanced work in biochemistry and molecular biology should take the Biochemistry and Molecular Biology 100 series directly. Students cannot receive credit for this course after they have completed any two courses from the Biochemistry and Molecular Biology 100A, 100B, and 100C sequence with grades of Pass, C, or better.","re":"courses 20A and 20B; and Chemistry 7 or 108A or 112A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70116":{"ty":"Laboratory","cr":"5","ge":[],"desc":"An introduction to the principles and practices of laboratory microbiology, with a substantial presentation of optical microscopy. Students are billed a materials fee.","re":"previous or concurrent enrollment in BIOL 119 is required. Enrollment restricted to biological sciences and affiliated majors, non-majors by permission of instructor.","com":[],"sec":[]},"70117":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of invertebrates and their habitats. Lecture format.","re":"courses 20A, 20B, and 20C. Course 136L must be taken concurrently. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70118":{"ty":"Laboratory","cr":"2","ge":[],"desc":"An examination of invertebrates and their habitats. Weekly laboratories or field trips. Students are billed a materials fee.","re":"courses 20A, 20B, and 20C. Course 136 must be taken concurrently. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70119":{"ty":"Lecture","cr":"5","ge":[],"desc":"A survey of cetaceans, pinnipeds, sirenians, and sea otters, including natural history, systematics, physiology, behavior, anatomy, and conservation.","re":"courses 20A, 20B, and 20C; course 138 is recommended. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70120":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of the history and mechanisms of evolutionary change. Topics include molecular evolution, natural and sexual selection, adaptation, speciation, biogeography, and macroevolution.","re":"courses 20A, 20B, 20C, and 105. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70300":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"First term of an integrated study of general chemistry. Course 1A suitable for people who have a solid background in high school chemistry. Covers a range of topics including the atomic structure of matter; molecules; chemical reactions; acids and bases; gases; and equilibria in the gas and liquid phase. Lecture: 3-1/2 hours; discussion: 1-1/4 hours. Students expected to use algebra to solve problems. Prerequisite(s): high school level chemistry.","re":null,"com":[],"sec":[]},"70301":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Second term of an integrated study of general chemistry. Coverage includes quantum mechanics; the hydrogen atom; many-electron atoms and chemical periodicity; elementary covalent bonding; thermochemistry; and intermolecular forces and solutions, including colligative properties. Lecture: 3-1/2 hours, discussion: 1-1/4 hours.","re":"course 1A or a grade of 5 on the AP chemistry examination. Concurrent enrollment in course 1M is required. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70302":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Third term of an integrated study of general chemistry. Coverage includes thermodynamics; chemical kinetics; oxidation-reduction and electrochemistry; liquids and solids; transition metals; and nuclear chemistry. Lecture: 3-1/2 hours; discussion: 1-1/4 hours.","re":"course 1B. Concurrent enrollment in course 1N is required. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70303":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence illustrating topics covered in courses 1B and 1C and important experimental techniques. Laboratory: 3 hours; lecture: 1-1/4 hours. Students are billed a materials fee. Course 1M offered in winter 2008 and spring2008 ; 1N offered in spring 2008 and fall 2008.","re":"course 1A. Concurrent enrollment in course 1B is required. Prerequisite waived for non-UCSC students.","com":[],"sec":[{"num":"70304","sec":"01A","loct":[{"t":null,"loc":"TBA"}],"ins":"Staff","cap":"18"},{"num":"70305","sec":"01B","loct":[{"t":null,"loc":"TBA"}],"ins":"Staff","cap":"18"}]},"70306":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence illustrating topics covered in courses 1B-1C, respectively, and important experimental techniques. Laboratory: 3 hours; lecture: 1-1/4 hours. Students are billed a materials fee. Course 1M offered in winter 2008 and spring 2008; 1N offered in spring 2008 and fall 2008.","re":"course 1M. Concurrent enrollment in course 1C is required. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70307","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"15:00"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"70308","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"15:00"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"71765","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"15:30","end":"18:30"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"}]},"70310":{"ty":"Lecture","cr":"5","ge":[],"desc":"An integrated study of fundamental organic chemistry, with emphasis on materials especially relevant to the biological sciences. Students with credit for course 112A cannot receive credit for course 108A; students with credit for 112B or 112C cannot receive credit for 108B. Lecture: 3-1/2 hours, discussion: 1-1/4 hours.","re":"course 1C or 4B. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"71260","sec":"01A","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"11:35","end":"12:45"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71261","sec":"01B","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"13:15","end":"14:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71262","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"13:10"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71263","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:15","end":"17:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"}]},"70311":{"ty":"Lecture","cr":"5","ge":[],"desc":"An integrated study of fundamental organic chemistry, with emphasis on materials especially relevant to the biological sciences. Students with credit for course 112A cannot receive credit for course 108A; students with credit for 112B or 112C cannot receive credit for 108B. Lecture: 3-1/2 hours, discussion: 1-1/4 hours.","re":"course 108A or 112A. Prerequisite waived for non-UCSC students.","com":[],"sec":[{"num":"71264","sec":"01A","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"11:35","end":"12:45"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71265","sec":"01B","loct":[{"t":{"day":["Monday","Wednesday"],"time":{"start":"13:15","end":"14:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71266","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"13:10"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"},{"num":"71267","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:15","end":"17:25"}},"loc":"Thimann Lab 101"}],"ins":"Palleros,D.","cap":"25"}]},"70312":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory experience in organic chemistry associated with courses 108A-108B, respectively. Designed to introduce the student to the many techniques associated with organic chemistry while affording an opportunity to explore the concepts discussed in the lecture material. Laboratory: 4 hours, lecture: 1-1/4 hours. Students are billed a materials fee.","re":"courses 1C/N and 108A or concurrent enrollment. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70313","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70314","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"},{"num":"70315","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70316","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"},{"num":"71770","sec":"01E","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 261"}],"ins":"Palleros,D.","cap":"16"}]},"70317":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory experience in organic chemistry associated with courses 108A-108B, respectively. Designed to introduce the student to the many techniques associated with organic chemistry while affording an opportunity to explore the concepts discussed in the lecture material. Laboratory: 4 hours, lecture: 1-1/4 hours. Students are billed a materials fee.","re":"courses 108A/L and 108B or concurrent enrollment. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70318","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70319","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"11:30","end":"15:30"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"},{"num":"70320","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 275"}],"ins":"Palleros,D.","cap":"16"},{"num":"70321","sec":"01D","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"16:00","end":"20:00"}},"loc":"Thimann Lab 271"}],"ins":"Palleros,D.","cap":"16"}]},"70406":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"Writing by engineers and computer scientists, not to general audiences, but to engineers, engineering managers, and technical writers. Exercises include job application and resume, in-code documentation, algorithm description, naive-user documentation, library puzzle, survey article, proposal, progress report, formal technical report, and oral presentation. Offered in alternate quarters.","re":"satisfaction of Entry Level Writing and Composition requirements; Computer Science 12B or 13H or Computer Engineering 12. Enrollment restricted to School of Engineering majors.","com":[],"sec":[]},"70440":{"ty":"Lecture","cr":"5","ge":[],"desc":"Studies basic algorithms and their relationships to common abstract data types. Covers the notions of abstract data types and the distinction between an abstract data type and an implementation of that data type. The complexity analysis of common algorithms using asymptotic (big \"O\") notation is emphasized. Topics include sorting and searching techniques, basic graph algorithms, and algorithm design techniques. Abstract data types covered include priority queues, dictionaries, disjoint sets, heaps, balanced trees, and hashing. Familiarity with C, Java, and Unix is assumed.","re":"course 12B or 13H, Computer Engineering 16 or 16H, Mathematics 19B, and one course from the following: Mathematics 21, 22, 23A, or 24.","com":[],"sec":[]},"70542":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"For all interested students as well as prospective economics majors. Examines how markets allocate resources in different kinds of economies. Topics include competitive markets, monopoly, financial markets, income distribution, market failures, the environment, and the role of government.","re":null,"com":[],"sec":[]},"70543":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"For all interested students and prospective economics majors. Examines how the overall level of national economic activity is determined, including output, employment, and inflation. Explores the roles of monetary and fiscal policies in stabilizing the economy and promoting growth, with a focus on contemporary policy debates.","re":null,"com":[],"sec":[]},"70544":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to accounting principles and practice; preparation and analysis of financial statements; study of internal control procedures. Courses 10A and 10B satisfy the Accounting 1A-B requirement at UC Berkeley.","re":null,"com":[],"sec":[]},"70545":{"ty":"Lecture","cr":"5","ge":[],"desc":"Managerial accounting emphasizing analysis and control; accounting for corporations; introduction to taxation, budgeting, and equity/debt financing; management decision making. Courses 10A and 10B satisfy the Accounting 1A-B requirement at UC Berkeley.","re":"course 10A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70546":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Mathematical tools and reasoning, with applications to Economics 1. Topics are drawn from differential calculus and include limits, continuity, techniques of differentiation, differentials, relative and absolute extrema, and applied optimization.","re":"score of 31 or higher on Math Placement Exam. Students who do not place into precalculus should enroll in Math 2. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70547":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Mathematical tools and reasoning, with applications to Economics 2. Topics are drawn from integral calculus and multivariable calculus, including indefinite and definite integrals, separate differential equations, partial derivatives, total differentials, optimization in several variables, and Lagrange multiplier.","re":"course 11A, or Applied Mathematics and Statistics 11A, or Mathematics 11A, or Mathematics 19A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70550":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of resource allocation, the function of markets, consumer behavior, and the determination of price, output, and profits in competitive, monopolistic, and oligopolistic market structures. Also considers issues of welfare and public policy. Students cannot receive credit for this course and course 100M.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70551":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of income, employment, interest rates, and the price level. Examines the role of monetary and fiscal policy in economic stabilization. Also considers these issues as they relate to the global economy. Students cannot receive credit for this course and course 100N.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Course 100A is strongly recommended as preparation. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70552":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Practical methods for organizing and analyzing economic data, testing economic hypotheses, and measuring economic relationships. Regression analysis is the main empirical method, and basic statistical and probability theory is included. Students gain hands-on computer experience with an econometric software package. Students cannot receive credit for this course and Engineering 113.","re":"courses 1, 2, and either course 11B, Applied Mathematics and Statistics 11B, Mathematics 22, or Mathematics 23A. Courses 100A or 100B strongly recommended as preparation. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"70626":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Introduction to geography, geology, climate, hydrology, biotic communities, flora, wildlife, and scenic and recreational resources of the Santa Cruz mountains. Orientation in the field to the peaks, ridges, rivers, creeks, watersheds, vegetation, public lands, trail systems, and land uses of the range enables students to become familiar with natural history and ecology of the mountains.","re":null,"com":[],"sec":[]},"70627":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Covers principles of ecology including limits to species abundances, evolutionary ecology, population dynamics, community interactions and patterns, and ecosystem patterns and dynamics.","re":null,"com":[],"sec":[]},"70628":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Environmental policy issues are situated within historical developments in political and economic systems. Introduces some of the key concepts of politics and economics by way of examining the processes which have given rise to environmental issues, their social and political perception, and institutional responses.","re":null,"com":[],"sec":[]},"70643":{"ty":"Lecture","cr":"5","ge":[],"desc":"The evolution, taxonomy, physiology, behavior, ecology, and management of birds. Lecture, discussion, field format. Birds observed in habitats including bay, marsh, meadow, and forest. Evaluations based on a field journal and examinations.","re":"Courses 105 or Biology 138 are recommended. Enrollment restricted to junior and senior students.","com":[],"sec":[]},"70693":{"ty":"Independent Study","cr":"5","ge":[],"desc":"Students submit petition to sponsoring agency. May be repeated for credit.","re":null,"com":[],"sec":[]},"70708":{"ty":"Lecture","cr":"5","ge":["IH","A"],"desc":"An introduction to the basic elements, range, and diversity of cinematic representation and expression. Aesthetic, theoretical, and critical issues are explored in the context of class screenings and critical readings. Students are billed a course fee.","re":".","com":[],"sec":[{"num":"71404","sec":"01A","loct":[{"t":{"day":["Thursday"],"time":{"start":"15:15","end":"16:45"}},"loc":"Soc Sci 2 363"}],"ins":"Youmans,G.M.","cap":"25"}]},"70709":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"A survey of various experimental styles and practices in film and video, addressing the historical developments of these media formats. The course situates experimental film and video work within the larger contexts of artistic traditions as well as networks of production and reception. Students are billed for a course fee.","re":"course 20A . Enrollment restricted to film and digital media majors, pre-majors, and minors during priority enrollment; may be opened if space allows. Prerequisite(s): course 20A . Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70710":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Problems in writing for film and television are explored through the writing of original material and analysis of existing works. Various film genres, conventions, and styles, both fictional and nonfictional, are examined.  Prerequisite(s): satisfaction of the Entry Level Writing and Composition requirements. Admission by application process which may begin prior to start of quarter; application materials generally available final week of preceding quarter. See enrollment conditions section in quarterly","re":null,"com":[],"sec":[]},"70736":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of the political, social, and cultural history of the U.S. from the founding of the North American colonies to 1877.","re":null,"com":[],"sec":[]},"70802":{"ty":"Lecture","cr":"5","ge":[],"desc":"Goal is to understand and apply basic rules of grammar and the sociolinguistic rules of the language needed to carry out various, simple tasks; to learn to read and write hiragana, katakana, and 40 kanji.","re":null,"com":[],"sec":[]},"70803":{"ty":"Lecture","cr":"5","ge":[],"desc":"Goal is to understand and apply additional rules of grammar and the sociolinguistic rules of the language needed to carry out various tasks; to develop skills in reading and writing, learn to read and write 70 additional kanji.","re":"course 1; or placement by examination. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70817":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduction to U.S. and comparative legal institutions and practices. Examines diverse areas of law from torts to civil rights to international human rights. Why is America portrayed as having an activist legal culture; why is law used to decide so many questions from presidential elections to auto accidents; can law resolve disputes that, historically, have led to war and violence; is the legal system fair and/or effective, and, if so, for whom and under what conditions?","re":null,"com":[],"sec":[]},"70818":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the status of American civil liberties as provided by the Bill of Rights. Particular attention will be given to issues of concern relating to the aftermath of 9/11, including issues relating to detainees, freedom of information requests, wiretapping authority, watch lists, profiling, and creation of a domestic intelligence agency.","re":".","com":[],"sec":[]},"70829":{"ty":"Lecture","cr":"5","ge":["IH","W"],"desc":"Close reading and analysis of literary texts, including representative examples of several different genres and periods. An introduction to practical criticism required of all literature majors; should be completed prior to upper-division work in literature.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70873":{"ty":"Lecture","cr":"5","ge":[],"desc":"Operations on real numbers, complex numbers, polynomials, and rational expressions; exponents and radicals; solving linear and quadratic equations and inequalities; functions, algebra of functions, graphs; conic sections; mathematical models; sequences and series.","re":"placement exam score of 12 or higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70874":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Inverse functions and graphs; exponential and logorithmic functions, their graphs, and use in mathematical models of the real world; rates of change; trigonometry, trigonometric functions, and their graphs; and geometric series. Students cannot receive credit for both course 3 and Applied Mathematics and Statistics 3. Applied Mathematics and Statistics 3 can substitute for course 3.","re":"course 2 or placement exam score of 20 or higher. Prerequisite waived for non-UCSC stiudents.","com":[],"sec":[]},"70875":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Inverse functions and graphs; exponential and logorithmic functions, their graphs, and use in mathematical models of the real world; rates of change; trigonometry, trigonometric functions, and their graphs; and geometric series. Students cannot receive credit for both course 3 and Applied Mathematics and Statistics 3. Applied Mathematics and Statistics 3 can substitute for course 3.","re":"course 2 or placement exam score of 20 or higher. Prerequisite waived for non-UCSC stiudents.","com":[],"sec":[]},"70876":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"A modern course stressing conceptual understanding, relevance, and problem solving. The derivative of polynomial, exponential, and trigonometric functions of a single variable is developed and applied to a wide range of problems involving graphing, approximation, and optimization. Students cannot receive credit for both this course and course 19A or Applied Mathematics and Statistics 11A or Economics 11A.","re":"course 3 or Applied Mathematics and Statistics 3; or placement exam score of 31 or higher; or AP Calculus AB exam score of 3 or higher. Prerequisite Waived for non-UCSC students.","com":[],"sec":[]},"70877":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Starting with the fundamental theorem of calculus and related techniques, the integral of functions of a single variable is developed and applied to problems in geometry, probability, physics, and differential equations. Polynomial approximations, Taylor series, and their applications conclude the course. Students cannot receive credit for this course and course 19B, or Applied Mathematics and Statistics 11B, or Economics 11B.","re":"course 11A or AP Calculus AB exam score of 4 or 5, or BC exam score of 3 or higher, or IB Mathematics Higher Level exam score of 5 or higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70878":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"The definite integral and the fundamental theorem of calculus. Areas, volumes. Integration by parts, trigonometric substitution, and partial fractions methods. Improper integrals. Sequences, series, absolute convergence and convergence tests. Power series, Taylor and Maclaurin series. Students cannot receive credit for both this course and course 11B, Applied Math and Statistics 11B, or Economics 11B.","re":"course 19A or AP Calculus AB exam score of 4 or 5, or BC exam score of 3 or higher, or IB Mathematics Higher Level exam score of 5 of higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70879":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Systems of linear equations, matrices, determinants. Introduction to abstract vector spaces, linear transformation, inner products, geometry of Euclidean space, and eigenvalues. One quarter of college mathematics is recommended as preparation.","re":null,"com":[],"sec":[]},"70880":{"ty":"Lecture","cr":"5","ge":[],"desc":"Functions of several variables. Continuity and partial derivatives. The chain rule, gradient and directional derivative. Maxima and minima, including Lagrange multipliers. The double and triple integral and change of variables. Surface area and volumes. Applications from biology, chemistry, earth sciences, engineering, and physics. Students cannot receive credit for this course and course 23A.","re":"course 11B or 19B or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70881":{"ty":"Lecture","cr":"5","ge":[],"desc":"Functions of several variables. Continuity and partial derivatives. The chain rule, gradient and directional derivative. Maxima and minima, including Lagrange multipliers. The double and triple integral and change of variables. Surface area and volumes. Applications from biology, chemistry, earth sciences, engineering, and physics. Students cannot receive credit for this course and course 23A.","re":"course 11B or 19B or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70882":{"ty":"Lecture","cr":"5","ge":[],"desc":"Vectors in n-dimensional Euclidean space. The inner and cross products. The derivative of functions from n-dimensional to m-dimensional Euclidean space is studied as a linear transformation having matrix representation. Paths in 3-dimensions, arc length, vector differential calculus. Taylor's theorem in several variables, extrema of real-valued functions, constrained extrema and Lagrange multipliers, the implicit function theorem, some applications. Students cannot receive credit for this course and course 22.","re":"course 19B or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70883":{"ty":"Lecture","cr":"5","ge":[],"desc":"Double integral, changing the order of integration. Triple integrals, maps of the plane, change of variables theorem, improper double integrals. Path integrals, line integrals, parametrized surfaces, area of a surface, surface integrals. Green's theorem, Stokes theorem, conservative fields, Gauss' theorem. Applications to physics and differential equations, differential forms.","re":"course 23A. prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70884":{"ty":"Lecture","cr":"5","ge":[],"desc":"First and second order ordinary differential equations, with emphasis on the linear case. Methods of integrating factors, undetermined coefficients, variation of parameters, power series, numerical computation. Students cannot receive credit for this course and Applied Mathematics and Statistics 20.","re":"course 22 or 23A; course 21 is recommended as preparation. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70920":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"The most significant group in the history of popular music, the Beatles spanned the gamut of styles from hard-edged R & B to sophisticated art-rock. This course explores their work in detail, in its own terms, and in the historical/cultural/technological contexts. Students cannot receive credit for both this course and course 180V in the same quarter. Course 11C is recommended but not required as preparation.","re":null,"com":[],"sec":[]},"70930":{"ty":"Lecture","cr":"5","ge":[],"desc":"The systematics, physiology, ecology, behavior, and conservation of marine birds and mammals, with emphasis on the fauna and issues of the Monterey Bay area. Lectures are complemented by laboratory and field sessions. Lab topics include taxonomy and comparative morphology. Field exercises are designed to promote development of observation and identification skills. Field trips enable students to observe unique local species in their native habitats and learn current research techniques.","re":"course 80A, Biology 20C, or permission of instructor. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"70931":{"ty":"Independent Study","cr":"5","ge":[],"desc":"Students submit petition to sponsoring agency. May be repeated for credit.","re":null,"com":[],"sec":[]},"70948":{"ty":"Lecture","cr":"5","ge":["IH","Q"],"desc":"A study of correct reasoning, concentrating on developing the skills necessary to distinguish logically correct from logically incorrect arguments. The emphasis is on modern symbolic logic, although the traditional theory of the syllogism is also covered.","re":null,"com":[],"sec":[]},"70949":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An introduction to the main areas of philosophy using both classic and contemporary sources.  Focuses on central and enduring problems in philosophy such as skepticism about the external world, the mind-body problem, and the nature of morality.","re":null,"com":[],"sec":[]},"70950":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"This course is an introduction to the moral issues raised by our interactions with nonhuman animals and with the rest of the natural environment.  The course will relate traditional moral theories to contemporary literature on the ethics of nature conservation and environmental protection.  The course is intended as a first course in philosophy as well as a first course in ethics; therefore, questions concerning the nature of philosophical inquiry and the ways in which philosophical inquiry is different from inquiries conducted within other disciplines will also be addressed.","re":null,"com":[],"sec":[]},"71027":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduces prospective majors to the scientific study of behavior and mental processes and also provides an overview for non-majors. Emphasizes social, cognitive, developmental, and personality psychology and their interrelations.","re":null,"com":[],"sec":[]},"71028":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"An introduction to elementary statistical principles and techniques relevant to psychological research. Topics covered include basic parametric and nonparametric statistics, analysis of variance, and simple factorial designs. This course is prerequisite to course 181.","re":"course 1, and Applied Mathematics and Statistics 3 or Mathematics 3 or 11A or satisfactory placement score on math placement exam or CEEB Advanced Placement Calculus AB exam. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71029":{"ty":"Lecture","cr":"7","ge":[],"desc":"An introduction to research methods used to investigate human psychology. Course emphasizes critical thinking, designing and conducting research, analyzing and interpreting data, and writing a professional research report.","re":"course 2 or Applied Mathematics and Statistics 5.  Prerequisite waived for non-UCSC students.","com":[],"sec":[{"num":"71030","sec":"01A","loct":[{"t":{"day":["Wednesday"],"time":{"start":"12:00","end":"14:00"}},"loc":"Soc Sci 2 171"}],"ins":"Wilson,N.L.","cap":"20"},{"num":"71031","sec":"01B","loct":[{"t":{"day":["Wednesday"],"time":{"start":"14:00","end":"16:00"}},"loc":"Soc Sci 2 171"}],"ins":"Wilson,N.L.","cap":"20"},{"num":"71585","sec":"01C","loct":[{"t":{"day":["Wednesday"],"time":{"start":"16:00","end":"18:00"}},"loc":"Soc Sci 2 171"}],"ins":"Wilson,N.L.","cap":"25"}]},"71032":{"ty":"Lecture","cr":"5","ge":[],"desc":"An analysis of contemporary research in social psychology and of what that research can teach us about the world we live in. Problems of conformity, propaganda, prejudice, attraction, and aggression. Focuses on a person's relationship with other people—how he or she influences them and is influenced by them.","re":"course 1. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71034":{"ty":"Lecture","cr":"5","ge":[],"desc":"Survey of theory and research on the nature of behavioral disorders. Covers psychological, biological, developmental, and socio-cultural approaches.","re":"course 1 or 60; course 60 highly recommended as preparation. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71138":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"A systematic study of social groups ranging in size from small to social institutions to entire societies. Organized around the themes of social interaction, social inequality, and social change. Fulfills lower-division major requirement.","re":null,"com":[],"sec":[]},"71139":{"ty":"Lecture","cr":"5","ge":["IS","E"],"desc":"Introduction to comparative and historical sociology. Focuses on the global integration of human society. Examines social changes such as industrialization, globalization, colonial rule, and the rise of Islamic fundamentalism. Uses social theory (including ideas from Marx, Weber, and Adam Smith) to explore the making of institutions like the nation-state, the World Trade Organization, the World Bank, and the International Monetary Fund. Fulfills lower-division major requirement.","re":null,"com":[],"sec":[]},"71140":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the interconnections between sports and society using sociological theories and methods. Topics include class, race, and gender; mass media and popular culture; political economy; education and socialization; leisure patterns (participants and spectators); globalization and cross-national comparisons.","re":null,"com":[],"sec":[]},"71195":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Challenges of performing Shakespearean and Renaissance plays are explored through confronting the acting problems they pose. Attention to verse scansion, character analysis, and textual meaning. Strategies for enacting scenes and monologues are tested in class presentations. May be repeated for credit.","re":null,"com":[],"sec":[]},"71214":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71215":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71216":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71217":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71245":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Introduction to statistical methods/reasoning, including descriptive methods, data-gathering (experimental design and sample surveys), probability, interval estimation, significance tests, one- and two-sample problems, categorical data analysis, correlation and regression. Emphasis on applications to the natural and social sciences. Students cannot receive credit for this course if they have already received credit for course 7.","re":null,"com":[],"sec":[]},"71246":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Introduction to statistical methods/reasoning, including descriptive methods, data-gathering (experimental design and sample surveys), probability, interval estimation, significance tests, one- and two-sample problems, categorical data analysis, correlation and regression. Emphasis on applications to the natural and social sciences. Students cannot receive credit for this course if they have already received credit for course 7.","re":null,"com":[],"sec":[]},"71247":{"ty":"Studio","cr":"5","ge":[],"desc":"Special studies in painting as announced. Students are billed a materials fee. May be repeated for credit.","re":"course 24A or 24B, and 103. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71248":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Properties of the solar system, the sun, solar system exploration, the physical nature of the Earth and the other planets, comets and asteroids, origin of the solar system, possibility of life on other worlds, planet formation, and search for planets beyond the solar system. Intended for nonscience majors. Courses 3, 4, and 5 are independent and may be taken separately or sequentially.","re":null,"com":[],"sec":[]},"71249":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to ecology and evolution covering principles of evolution at the molecular, organismal, and population levels. Evolutionary topics include genetic and phenotypic variation, natural selection, adaptation, speciation, and macroevolution. Also covers behavioral, population, and community ecology including applied ecological issues.","re":null,"com":[],"sec":[]},"71251":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to French language and culture with practice in all four language skills: listening, speaking, reading, and writing. Intended for students with no previous study of French.","re":null,"com":[],"sec":[]},"71252":{"ty":"Lecture","cr":"5","ge":[],"desc":"Study of representative work by Charles Dickens. Topic for summer 2008: Dickens'","re":null,"com":[],"sec":[]},"71253":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A consideration of ethical issues and theories focusing on the foundation of moral value and the principles governing character and behavior. Designed to extend and develop the student's abilities in philosophical reasoning about ethics.","re":null,"com":[],"sec":[]},"71254":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of recent movements in European thought, such as phenomenology, existentialism, hermeneutics, critical theory, continental feminism, and poststructuralism, with some attention to their 19th-century precursors. Selections from major philosophical treatises are supplemented with literary works.","re":null,"com":[],"sec":[]},"71255":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Elementary mechanics. Vectors, Newton's laws, inverse square force laws, work and energy, conservation of momentum and energy, and oscillations.","re":"Concurrent enrollment in course 6L required. Corequisite: Mathematics 11A or 19A or 20A.","com":[],"sec":[]},"71256":{"ty":"Seminar","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences","A"],"desc":"Mockumentaries such as","re":null,"com":[],"sec":[]},"71259":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"Introduces library and field research methods and also provides instruction and practice in writing from research, addressing issues such as voice, argument, and documentation. Students write four lengthy essays and do considerable informal writing. Course 161 includes sections for re-entry women, transfer students, and students in the EOP Faculty Mentor Program. Prerequisite(s): satisfaction of Entry Level Writing and Composition requirements. Students should contact the instructor for enrollment information.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71269":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71270":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71272":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching physical education. Introduces candidates to theoretical and research basis in physical education and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71273":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching physical education. Introduces candidates to theoretical and research basis in physical education and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71274":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching visual arts. Introduces candidates to theoretical and research basis for teaching visual arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71275":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching visual arts. Introduces candidates to theoretical and research basis for teaching visual arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71276":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching performing arts. Introduces candidates to theoretical and research basis for teaching performing arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71277":{"ty":"Lecture","cr":"2","ge":[],"desc":"Examines pedagogical understanding in teaching performing arts. Introduces candidates to theoretical and research basis for teaching performing arts and content standards and frameworks. Also investigates and presents instructional practices.","re":"Enrollment restricted to graduate education master's/credential majors.","com":[],"sec":[]},"71278":{"ty":"Lecture","cr":"5","ge":[],"desc":"Provides a theoretical and practical foundation for teaching reading within content area instruction in middle school and secondary classrooms.  Field experiences and interactive instruction will facilitate learning about strategies, curricula, methods, materials, and observation. Intended for students pursuing a single subject credential.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71279":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71280":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71281":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71291":{"ty":"Lecture","cr":"5","ge":[],"desc":"A sustained inquiry into the social, political, economic, and historical foundations of schools with an emphasis on community attitudes toward education. Student narratives of engagement and resistance will provide a basis for insights and interventions useful to educators.","re":"Enrollment restricted to program enrollees.","com":[],"sec":[]},"71292":{"ty":"Lecture","cr":"5","ge":[],"desc":"A sustained inquiry into the social, political, economic, and historical foundations of schools with an emphasis on community attitudes toward education. Student narratives of engagement and resistance will provide a basis for insights and interventions useful to educators.","re":"Enrollment restricted to program enrollees.","com":[],"sec":[]},"71293":{"ty":"Lecture","cr":"5","ge":[],"desc":"A sustained inquiry into the social, political, economic, and historical foundations of schools with an emphasis on community attitudes toward education. Student narratives of engagement and resistance will provide a basis for insights and interventions useful to educators.","re":"Enrollment restricted to program enrollees.","com":[],"sec":[]},"71294":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71295":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71296":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71297":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71298":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71299":{"ty":"Lecture","cr":"5","ge":[],"desc":"Required for master's students in education. Three basic units comprise the subject matter: teaching/learning, with such topics as development, learning, pedagogy, and socialization theories; second, schooling, as the context of teaching/learning both in its existent structures and its reform movements; third, the sociocultural context in which educational institutions exist, topics such as cultural and historical forces, political and economic condition, family, and community structures.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71352":{"ty":"Seminar","cr":"5","ge":[],"desc":"A graduate seminar on a research topic in computer engineering which varies according to instructor. Possible topics include, but are not limited to, communication networks, data compression, special-purpose architectures, computer arithmetic, software reliability and reusability, systolic arrays.","re":null,"com":[],"sec":[]},"71360":{"ty":"Lecture","cr":"5","ge":[],"desc":"Analysis of the theory and practice of decision making in business firms, applying the concepts and techniques of microeconomics. Topics may include pricing schemes, non-price competition, internal organization of firms, incentive contracts, asymmetric information, and game theory. Case studies are used to illustrate some topics.","re":"courses 100A or 100M, and 113. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71361":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Concentrated study of films from one cinematic grouping with similar themes and narrative structures such as westerns, musicals, or science fiction, or a comparative study of different genres. History, theory, and criticism of the genre are covered. Students are billed a course fee. May be repeated for credit.","re":"course 132A, 132B, 132C, 134A or 134B. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71363":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the category of nonfiction through a historical and theoretical study of documentary in film and video.  Addresses ethnographic film, Soviet and Griersonian documentary, cinema verité and/or other selected documentary texts and the issues of representation they raise.  Students are billed a course fee.","re":"course 20A or 20B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71367":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An introduction to the major areas, problems, and techniques of modern linguistics. (Formerly course 20,","re":null,"com":[],"sec":[]},"71368":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"The limit of a function, calculating limits, continuity, tangents, velocities, and other instantaneous rates of change. Derivatives, the chain rule, implicit differentiation, higher derivatives. Exponential functions, inverse functions, and their derivatives. The mean value theorem, monotonic functions, concavity, and points of inflection. Applied maximum and minimum problems. Students cannot receive credit for both this course and course 11A or Applied Mathematics and Statistics 11A or Economics 11A.","re":"course 3 or Applied Mathematics and Statistics 3 or placement exam score of 40 or higher or AP Calculus AB exam score of 3 or higher. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71371":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines basic theories, models, methods, and research findings in human memory. Both traditional and nontraditional topics are covered. Students cannot receive credit for this course and course 130A.","re":"course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71372":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on contemporary research in the psychology of human emotions. Special attention given to work in cognitive science, including psychology, linguistics, philosophy, and anthropology, on how emotions are central to understanding human action and mental life.","re":".","com":[],"sec":[]},"71374":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Exploration of nature, structure, and functionings of American society. Explores the following: social institutions and economic structure; the successes, failures, and intractabilities of institutions; general and distinctive features of American society; specific problems such as race, sex, and other inequalities; urban-rural differences. Fulfills lower-division major requirement.","re":null,"com":[],"sec":[]},"71376":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Students work on developing resonance, range and expressivity for stage performance via physical exercises and text explorations undertaken in small groups. Prerequisite(s): course 20. Audition required for acceptance into class.","re":null,"com":[],"sec":[]},"71377":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"A writing course examining news and feature articles in popular print media. Students write their own articles and analyze how a particular content is mandated by conventional forms, by the structure of the industries, and by ideas of \"newsworthiness.\" Designed for journalism minors and students for whom a course in media criticism is central to their program. Prerequisite(s): satisfaction of the Entry Level Writing and Composition requirements; qualifications determined by instructor at first class meeting.","re":null,"com":[],"sec":[]},"71384":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"A continuation of 6A. Wave motion in matter, including sound waves. Geometrical optics, interference and polarization, statics and dynamics of fluids. Introduction to thermodynamics, including temperature, heat, thermal conductivity, and kinetic energy.","re":"courses 5A/L or 6A/L and Mathematics 11A or 19A or 20A; concurrent enrollment in course 6M required. Corequisite: Mathematics 11B or 19B or 20B.","com":[],"sec":[]},"71385":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6B. One three-hour laboratory session per week.","re":"courses 5A/L or 6A/L; concurrent enrollment in course 6B required. Prerquisites waived for non-UCSC students.","com":[],"sec":[]},"71387":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Senior seminar that focuses on identity development in adolescence and young adulthood. Discusses theory and research on the development of personal and social identities and the sociocultural contexts in which these personal and social identities are negotiated. Satisfies seminar requirement. Satisfies senior comprehensive requirement.","re":"satisfaction of the Entry Level Writing and Composition requirements; course 102 strongly recommended. Enrollment restricted to senior psychology majors or by permission of instructor.","com":[],"sec":[]},"71388":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71389":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71390":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71391":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71392":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71393":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71394":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71395":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71397":{"ty":"Studio","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"Theory and practice of improvisation in the performing arts with an emphasis on acting improvisation techniques. Readings and films develop a theoretical and historical understanding of spontaneous invention on stage. Students attend area theater improvisational performances.","re":null,"com":[],"sec":[]},"71398":{"ty":"Seminar","cr":"5","ge":["W","A"],"desc":"Uses writing to respond to Shakespeare Santa Cruz's summer productions. Requires frequent assignments, such as reviews, interviews, performance notes, comparisons of productions, background pieces, and reflective essays. Students regularly revise work in response to instructor and peer feedback.","re":"Satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71399":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Covers the basics of marine mammal taxonomy, anatomy, and field methods with an emphasis on local field identification and understanding of local species. Will include field trips to Long Marine Lab, Ano Nuevo, and Monterey Bay. Students are billed a materials fee.","re":"courses 20A, 20B, and 20C. Must be taken concurrently with course 139. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71400":{"ty":"Lecture","cr":"5","ge":[],"desc":"Topics in morphology, physiology, development, genetics, and endocrinology selected to exemplify current issues and perspectives in organismic biology.","re":"course 20A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71401":{"ty":"Lecture","cr":"5","ge":["IH","E"],"desc":"An introductory course to basic theories in American studies, including the U.S. in historical and transnational perspectives, social and cultural diversity and conflict in American life, and debates over concepts of national culture and citizenship.","re":null,"com":[],"sec":[]},"71402":{"ty":"Laboratory","cr":"5","ge":[],"desc":"An introduction to the principles and practices of laboratory microbiology, with a substantial presentation of optical microscopy. Students are billed a materials fee.","re":"previous or concurrent enrollment in BIOL 119 is required. Enrollment restricted to biological sciences and affiliated majors, non-majors by permission of instructor.","com":[],"sec":[]},"71405":{"ty":"Lecture","cr":"5","ge":[],"desc":"This course on special topics in ethnography will be taught on a rotating basis by various faculty members. Precise focus of each year's courses will vary according to the instructor and will be announced by the department. May be repeated for credit.","re":null,"com":[],"sec":[]},"71406":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to photography as an art form that explores visual ideas beginning with camera-ready use, negative development, and printing. Prepares for further work in photography or for collaboration with other media in art including computer arts and two- and three-dimensional mixed media. Critically examines photographic works while reading historical and theoretical texts. Students are billed  a materials fee.","re":".","com":[],"sec":[]},"71475":{"ty":"Seminar","cr":"5","ge":["E"],"desc":"Introduction to the history and relevance of film and video productions within Asian America. Explores reasons why, and ways how, Asian Americans have represented themselves through the visual medium of moving pictures. Emphasis on basic tools of film analysis and appreciation.","re":null,"com":[],"sec":[]},"71480":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Focuses on drawing from the human figure and exploring the figure for the purpose of personal expression and social communication. Intended for the intermediate/advanced drawing student. Students are billed a materials fee. May be repeated for credit.","re":"course 20. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71482":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to drawing, processing, and printing of lithographs from stone. Emphasis on discovery of tonal, textural, and expressive potential from the surface of the stone, while establishing individual directions in imagery. Condensed history of the medium, technical theory, and critique in lecture and demonstrations. Students are billed a materials fee. May be repeated for credit.","re":"course 20. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71487":{"ty":"Lecture","cr":"5","ge":[],"desc":"Mendelian and molecular genetics; mechanisms of heredity, mutation, recombination, and gene action. Students cannot receive credit for this course and course 106.","re":"courses 20A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71488":{"ty":"Lecture","cr":"5","ge":[],"desc":"Cell and molecular biology of bacteria and their viruses, including applications in medicine, public health, agriculture, and biotechnology.","re":"course 100 or Biochemistry 100A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71489":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to social and reproductive behavior. Emphasis on studies of vertebrates in their natural habitat. Ideas concerning the evolution of social behavior, mating systems, and individual reproductive strategies. Case histories of well-studied animals that illustrate key principles in courtship and mating, parental behavior, and food-getting behavior.","re":"courses 20A, 20B, and 20C. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71495":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Interdisciplinary study of Las Vegas—communities, civic structures, and commercial industry. Explores the social, political, and economic forces which have inflected urban growth and design in Las Vegas from 1900–2000.","re":null,"com":[],"sec":[]},"71497":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of the political, social, and cultural history of the U.S. from 1877 to the present.","re":null,"com":[],"sec":[]},"71500":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Social, cultural, economic, and political history from the triumph of Liberalism to the present day, focusing on four key periods: the dictatorship of Porfirio Diaz (1900–1910), the armed phase of the Revolution (1910–1920), the consolidation of revolutionary programs and a \"single-party democracy\" (1920–1940), and the developmentalist counter-revolution since 1940. Provides background for understanding the Mexican diaspora to the U.S.","re":null,"com":[],"sec":[]},"71505":{"ty":"Seminar","cr":"5","ge":["A"],"desc":"Introduction to the crafts and techniques of poetry, fiction, and creative non-fiction, identifying and exploring traditional and non-traditional literary forms and genres while working on individual creative writing projects. An author reading and two workshop sections per week. May be repeated for credit.","re":"satisfaction of the Entry Level Writing requirement. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71511":{"ty":"Lecture","cr":"5","ge":["IH","A","E"],"desc":"Designed to provide students with thorough and comprehensive background in history and roots of jazz as a musical style from its African roots to the present. Essential jazz styles and traditions are discussed through lectures, required listening, readings, lecture demonstrations, and film presentations.","re":null,"com":[],"sec":[]},"71512":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"An examination of the conceptual and moral issues that arise in connection with such topics as abortion, racism and war and violence, world hunger, humans and their interactions with the nonhuman environment. The readings are drawn from recent philosophical articles on these topics.","re":null,"com":[],"sec":[]},"71513":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Problems about form, meaning, and interpretation in art, as found in major aesthetic theories from the philosophical tradition, and also in a variety of encounters between recent philosophy and the arts. One course in philosophy is strongly recommended prior to taking this course.","re":null,"com":[],"sec":[]},"71515":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Introduction to electricity and magnetism. Electromagnetic radiation, Maxwell's equations.","re":"courses 6A/L or 5A/L, and Mathematics 11B or 19B or 20B; concurrent enrollment in course 6N required. Corequisite: Math 22 or 23A suggested.","com":[],"sec":[]},"71518":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Can common global interest prevail against particular sovereign desires? Surveys selected contemporary issues in global politics such as wars of intervention, ethnic conflict, globalization, global environmental protection, and some of the different ways in which they are understood and explained.","re":null,"com":[],"sec":[]},"71520":{"ty":"Lecture","cr":"5","ge":[],"desc":"Psychological development from birth to adolescence, with primary emphasis on infancy and childhood. A broad introduction to the nature of change during childhood and adolescence and to theories of development.","re":"course 1. Enrollment restricted to pre-psychology majors. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71521":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduces basic concepts in cognitive psychology. Topics include thinking, consciousness, perceiving, language, remembering, reasoning, problem solving, and decision-making.","re":"course 1. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71523":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on behavioral and brain manifestations of deception. Topics include developmental changes that allow us to understand and to use deception, physical implications of lying expressed in the face, voice, posture, and brain activity. Also covers mechanical or behavioral techniques used in deceptive behavior, whether in the form of overt behavior or brain activity.","re":"course 3; course 20 or any upper-division cognitive course strongly recommended. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71524":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines contemporary theories, findings, and social issues regarding the psychology of women. Emphasis is placed on understanding how gender, class, race, ethnicity, and sexuality shape women's experiences across the lifespan. Students cannot receive credit for this course and course 41.","re":".","com":[],"sec":[]},"71527":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the history of the use and abuse of consciousness-altering substances like alcohol and other drugs. Social-psychological theories of addiction are reviewed in tandem with political-economic analyses to identify the social conditions under which the cultural practices involved in drug use come to be defined as public problems. An introductory sociology course is recommended prior to taking this course.","re":null,"com":[],"sec":[]},"71529":{"ty":"Lecture","cr":"5","ge":[],"desc":"Concerns the routine and taken-for-granted activities that make up our interactions with one another, consisting in large part—but not exclusively—of verbal exchanges. Emphasis on the socially situated character of communication, whether intimacy between two people or dominance of a group.","re":"An introductory sociology course is recommended prior to taking this course. Enrollment restricted to sophomores, juniors, and seniors.","com":[],"sec":[]},"71531":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"Spanish Placement Examination score of 10.","com":[],"sec":[]},"71532":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"course 1 or Spanish Placement Examination score of 20.","com":[],"sec":[]},"71542":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71543":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71544":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71546":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Case-study-based introduction to statistical methods as practiced in the biological,  environmental, and health sciences. Descriptive methods, experimental design, probability, interval estimation, hypothesis testing, one- and two-sample problems, power and sample size calculations, simple correlation and simple linear regression, one-way analysis of variance, categorical data analysis. (Formerly","re":"score of 31 or higher on mathematics placement exam, course 3, 11A, Mathematics 3, 11A, 19A or by permission of instructor. Concurrent enrollment in course 7L is required. Prerequisites and restrictions waived for non-UCSC students.","com":[],"sec":[]},"71547":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Computer-based laboratory course in which students gain hands-on experience in analysis of data sets arising from statistical problem-solving in the biological, environmental, and health sciences. Descriptive methods, interval estimation, hypothesis testing, one-and two-sample problems, correlation and regression, one-way analysis of variance, categorical data analysis. (Formerly","re":"score of 31 or higher on mathematics placement exam, course 3, 11A, Mathematics 3, 11A, 19A, or by permission of instructor. Concurrent enrollment in course 7 is required. Prerequisites and restrictions waived for non-UCSC students.","com":[],"sec":[]},"71550":{"ty":"Lecture","cr":"5","ge":[],"desc":"Principles and concepts underlying the function of tissues and organ systems in animals with emphasis on vertebrate systems. Students cannot receive credit for this course and course 130.","re":"courses 20A, 20B, and 20C. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71551":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Experiments conducted with primary focus on quantitative physiological principles of organ systems and intact organisms. Students cannot receive credit for this course and course 130L. Students are billed a materials fee.","re":"courses 20A, 20B, and 20C. Concurrent enrollment in course 131 is required. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71555":{"ty":"Lecture","cr":"5","ge":["T7-NaturalSciencesorSocialSciences"],"desc":"Focuses on the creation and management of technology start-ups and small companies, using case studies and team projects as the basis for learning and applying the course materials.","re":null,"com":[],"sec":[]},"71560":{"ty":"Lecture","cr":"5","ge":[],"desc":"A non-survey course suitable for people who have not had biology. A historical and experimental approach covers five key biological concepts: homeostasis, the integration of structure and function, cell theory, the mechanism of heredity, and evolution. Students cannot receive credit for this course after receiving prior credit for course 20A, 20B, or 20C.","re":".","com":[],"sec":[]},"71563":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines variety of topics in constitutional law that are not covered in courses 111A and 111B. Focuses primarily on Supreme Court decisions and common-law debates.","re":".","com":[],"sec":[]},"71566":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6C. One three-hour laboratory session per week.","re":"courses 6A/L or 5A/L; concurrent enrollment in course 6C required; courses 6B/M are suggested. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71567":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6C. One three-hour laboratory session per week.","re":"courses 6A/L or 5A/L; concurrent enrollment in course 6C required; courses 6B/M are suggested. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71573":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Focuses on pleasures and horrors of getting old. Explores cultural and personal fears and then examines the social realities, which are, at once, worse than and not nearly as bad as you might think.","re":null,"com":[],"sec":[]},"71575":{"ty":"Lecture","cr":"2","ge":[],"desc":"Reviews issues of literacy and writing in secondary content areas. Students write in several genre and prepare lesson plans for teaching writing within the discourse of their respective curricular area.","re":"Enrollment restricted to education graduate students.","com":[],"sec":[]},"71576":{"ty":"Lecture","cr":"2","ge":[],"desc":"Addresses the preparation of teachers for creating a supportive, healthy environment for student learning. Covers topics related to physical, emotional, and social health. (Formerly","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71577":{"ty":"Lecture","cr":"2","ge":[],"desc":"Addresses the preparation of teachers for creating a supportive, healthy environment for student learning. Covers topics related to physical, emotional, and social health. (Formerly","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71578":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71579":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71580":{"ty":"Independent Study","cr":"5","ge":[],"desc":"","re":null,"com":[],"sec":[]},"71582":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71586":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71587":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71588":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71589":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71590":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71591":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71592":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71593":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71594":{"ty":"Seminar","cr":"5","ge":[],"desc":"Familiarizes students with the basic concepts of educational research and facilitates progress toward completion of dissertation while identifying faculty and community resources available to assist in research.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71629":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores history of Marxist thought and activism in the U.S. with special emphasis on uses and effects of Marxism within aggrieved communities of color.","re":"satisfaction of the Entry Level Writing and Composition requirements.","com":[],"sec":[]},"71630":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Present-day values and social life of selected sub-Saharan African people examined using anthropological studies and African literature.","re":null,"com":[],"sec":[]},"71631":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences"],"desc":"Introduces anthropological concepts and approaches to historical and contemporary globalizations. Using ethnographies, films, and other cultural productions, raises questions about the impacts of transnational capitalism, colonialism, migration/movement, and media on \"local\" and \"global\" identities, cultures, and communities.","re":null,"com":[],"sec":[]},"71632":{"ty":"Lecture","cr":"5","ge":[],"desc":"Deals with evidence and theories concerning the origins of complex society; the transition from egalitarian, foraging societies to the hierarchical, economically specialized societies often referred to as \"civilizations.\" Focuses on both Old World and New World cultures.","re":"course 3. Prerequisites and restrictions waived for non-UCSC students.","com":[],"sec":[]},"71633":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to the methods, materials, and purposes of drawing to develop perceptual and conceptual skills through a series of assignments, providing various approaches to drawing as a tool for creative exploration. Discussions and critiques facilitate the development of critical skills. Designed for students considering the art major. Students are billed a materials fee.","re":".","com":[],"sec":[]},"71634":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to medium of oil painting and to painting process. Assignments develop understanding of potential of this medium as a tool for perceptual and conceptual exploration. Slide lectures introduce assignments and are basis for class discussion of contemporary and historical art activity in the field. Students are billed a materials fee. (Formerly course 24.)","re":"course 20 or 80A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71635":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Survey of print medium: basic terminology, techniques, application of tools, materials, and condensed history of development of printmaking. Assignments consist of individual and collaborative projects aimed at building skills and gathering technical experience. Introduction to relief printing (black and white and color), intaglio, letterpress, and interface between photography/computer and the handmade print. Exploration of print media for communication of issues including formal aesthetics, social/psychological and personal narrative. Students are billed a materials fee.","re":"course 20 or 80A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71636":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to a range of concepts and forms used to make contemporary sculpture. Assignments facilitate becoming familiar with sculptural techniques and materials to enable students to visually manifest their sculptural ideas. Combines lectures and demonstrations with work time in class. Students are billed a materials fee.","re":".","com":[],"sec":[]},"71637":{"ty":"Studio","cr":"2","ge":[],"desc":"Focuses on providing practical experience in all phases of exhibition design and implementation. General tasks of program operation supplemented with selective reading and written assignments designed to enhance theoretical understanding of broader issues in art administration. Includes field trips to galleries and museums as well as in-class visits by artists and arts professionals.","re":".","com":[],"sec":[]},"71638":{"ty":"Studio","cr":"5","ge":[],"desc":"Continuation of the development of a basic foundation in painting with emphasis on the development of individual, experimental procedures. Students are billed a materials fee. May be repeated for credit.","re":"course 24A or 24B. Enrollment restricted to art majors. Prerequisite(s): course 24A or 24B. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71639":{"ty":"Studio","cr":"5","ge":[],"desc":"Special studies in printmaking, as announced. Students are billed for a materials fee. May be repeated for credit.","re":"course 25, 26, or 27. Enrollment restricted to art and pre-art majors.","com":[],"sec":[]},"71640":{"ty":"Studio","cr":"5","ge":[],"desc":"Special studies in photography, concentrating on specific subject matter or media. Topics may include documentary photography, landscape, alternative processes, or mixed media. Students are billed a materials fee. May be repeated for credit.","re":"course 30. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71641":{"ty":"Studio","cr":"5","ge":[],"desc":"Special studies in photography, concentrating on specific subject matter or media. Topics may include documentary photography, landscape, alternative processes, or mixed media. Students are billed a materials fee. May be repeated for credit.","re":"course 30. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71642":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to basic theories behind the digital production, manipulation, and output of photographic images. Through readings and production, students address major issues specific to working with images in an increasingly digital environment. Students are billed a materials fee. May be repeated for credit.","re":"course 30. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71643":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"Artists write about their work for many reasons:  they create proposals, exhibition notes, press releases, resumés, scholarly statements about their creative process, and more. This course is for students interested in becoming better writers and in writing more effectively about art. Provides practice and discussion for art students as they face a variety of situations requiring clear and critical writing skills.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71644":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"Integrating studio work and field study, combined with in-class writing exercises, students create a writing portfolio to accompany their artwork. Working with journals, doubling as an artist's notebook, writing is encouraged to enhance students' understanding of their art and that of other artists.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71645":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"The universe explained. Fundamental concepts of modern cosmology (Big Bang, dark matter, curved space, black holes, star and galaxy formation), the basic physics underlying them, and their scientific development.  Intended for non-science majors. Courses 3, 4, and 5 are independent and may be taken separately.","re":null,"com":[],"sec":[]},"71646":{"ty":"Lecture","cr":"5","ge":[],"desc":"Function, organization, and regulation of the major organ systems of humans, with emphasis on integration among systems. Students cannot receive credit for this course and course 131.","re":"courses 20A, 20B, 100, and 110.","com":[],"sec":[]},"71647":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Examines fundamental principles of systemic physiology focusing on the human. Students cannot receive credit for this course and course 131L. Students are billed a materials fee. (General Education Code(s): W satisfied by taking  this course and course 189.)","re":"satisfaction of the Entry Level Writing and Composition requirements; courses 20A, 20B, 100, and 110. Concurrent enrollment in 130 is required. Enrollment restricted to biological sciences and affiliated majors, non-majors by permission.","com":[],"sec":[]},"71648":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Examines criminal punishment in the U.S. with emphases on race, ethnicity, and gender. A brief historical review of punishment in the modern age is followed by an in-depth look at contemporary aspects of mass incarceration.","re":null,"com":[],"sec":[]},"71650":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Provides an introduction to computers. Personal computing is emphasized, and students are introduced to word processing, spreadsheets, database management, graphics, and programming. Covers fundamentals of computing and current and future uses of computer technology, PC hardware, Windows operating system, applications software, networking and the Internet, and developments in the computer industry.  Designed for students with little or no experience using computers. Students cannot receive credit for this course and Computer Science 2.","re":null,"com":[],"sec":[]},"71651":{"ty":"Lecture","cr":"5","ge":["IN","Q"],"desc":"Introduction to computer systems and assembly language and how computers compute in hardware and software. Topics include digital logic, number systems, data structures, compiling/assembly process, basics of system software, and computer architecture. May include C language.","re":"course 3 or 8, or Computer Science 10 or 12A  or 60G or 60N, or Biomolecular Engineering 60, or suitable programming experience; previous or concurrent enrollment in course 12L  required. Prerequisites waived for non-UCSC students","com":[],"sec":[]},"71652":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence in assembly language programming. The basics of logic design, both RISC and microcontroller programming. May include C language programming. Two two-hour laboratories per week .","re":"course 3 or 8, or Computer Science 10 or 12A  or 60G or 60N, or Biomolecular Engineering 60, or suitable programming experience; previous or concurrent enrollment in course 12 required. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71653":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"Introduction to applications of discrete mathematical systems. Topics include sets, functions, relations, graphs, trees, switching algebra, first order predicate calculus, mathematical induction, permutations, combinations, summation, and recurrences. Examples drawn from computer science and computer engineering.","re":"eligibility to enroll in Mathematics 19A (completion of Mathematics 2B or 3 or Mathematics Placement Exam score of 40 or higher) or completion of Mathematics 19A or 11A. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71654":{"ty":"Lecture","cr":"5","ge":["IN"],"desc":"Origin, evolution, and extinction of dinosaurs with emphasis on paleobiology and paleoecology. Covers fundamental paleontological and evolutionary principles, dinosaur anatomy and behavior, the hot-blooded/cold-blooded debate, dinosaur-bird relationships, diversity, exploits of the great dinosaur hunters, and dinosaurs' prospects. One and a half hour of discussion each week.","re":null,"com":[],"sec":[]},"71655":{"ty":"Lecture","cr":"5","ge":["T2-NaturalSciences","Q"],"desc":"Many meteorological phenomena are familiar to us: clouds, fog, rain, snow, wind, lightning, and severe storms. Climate is the sum of weather over long periods and is changing (e.g., greenhouse warming, ozone depletion, urban smog) due to mankind's activities. Conceptual understanding of how and why the present-day atmosphere behaves as it does and how this may change in the future is the primary goal of this course.","re":null,"com":[],"sec":[]},"71656":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of all major financial markets: equities, bonds, options, forwards, and futures. Uses modern financial theory, including asset pricing models such as CAPM and APT.","re":"courses 100A or 100M, and 113. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71657":{"ty":"Lecture","cr":"5","ge":[],"desc":"The evolution of markets and marketing; market structure; marketing cost and efficiency; public and private regulation; the development of marketing programs including decisions involving products, price, promotional distribution. (Formerly course 161.)","re":"course 100A or 100M. Prerequisite(s): course 100A or 100M. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71658":{"ty":"Seminar","cr":"5","ge":[],"desc":"Introduction to study of animals, including how field study can be made scientifically rigorous. Reviews evolutionary relationship among vertebrates and their special adaptions. Students are exposed to principles in population and community ecology, biogeography, and behavioral and physiological ecology as they relate to vertebrates.","re":"courses 24 and 100. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71659":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Lectures and demonstrations are combined with field applications to give students direct experience and knowledge of sustainable agriculture and horticulture practices and principles. UCSC Farm and Garden are the living laboratories for testing agroecological principles. Emphasis is placed on small-farm systems. Prerequisite(s): courses 130A and 130L. Enrollment restricted to majors in environmental studies and the combined majors with Earth sciences, biology and economics. Admission by interview only. May be repeated for credit.","re":null,"com":[],"sec":[]},"71660":{"ty":"Field Studies","cr":"5","ge":[],"desc":"Lectures and demonstrations are combined with field applications to give students direct experience and knowledge of sustainable agriculture and horticulture practices and principles. UCSC Farm and Garden are the living laboratories for testing agroecological principles. Emphasis is placed on small-farm systems. Prerequisite(s): courses 130A and 130L. Enrollment restricted to majors in environmental studies and the combined majors with Earth sciences, biology and economics. Admission by interview only. May be repeated for credit.","re":null,"com":[],"sec":[]},"71661":{"ty":"Lecture","cr":"5","ge":[],"desc":"Considers whether and how global poverty can be alleviated without irreparably damaging the environment. Examines interactions among population, economic growth, poverty, global consumption ethos, property rights systems, global economy, state capacity, and environmental damage. Scrutinizes impact of various developmental strategies adopted during the past 50 years on poverty, governance, and the environment.","re":"course 100. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71662":{"ty":"Seminar","cr":"5","ge":[],"desc":"The object is to provide a rigorous grounding in the method of political ecology and to demonstrate how this approach has been used in environmental analysis and problem solving by environmental social movements.","re":".","com":[],"sec":[]},"71663":{"ty":"Lecture","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences","A"],"desc":"Study of selected aspects of film, television, and/or digital media. Includes weekly screenings and historical/theoretical readings. May be repeated for credit.","re":null,"com":[],"sec":[]},"71664":{"ty":"Lecture","cr":"5","ge":[],"desc":"Intensive critical study of the work of one film auteur (director, screenwriter, actor, cinematographer). Themes, style, and structure are explored using various critical modes of analysis. Students are billed a course fee. May be repeated for credit.","re":"course 120. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71665":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"This analysis of girlhood narratives in contemporary U.S. film and popular culture produces an approach that accounts for the myriad ways girls bear dominant cultural fictions surrounding \"womanhood\" and represent signs of feminist, queer, and anti-racist resistance.","re":null,"com":[],"sec":[]},"71666":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Style matters: It is powerful and always changing. This course is organized around a series of  \"Style Wars\" that offer the chance to think about how and why style is repeatedly used to ignite social, and not simply aesthetic, change.","re":null,"com":[],"sec":[]},"71667":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Surveys the rise of complex societies: the formation of classical civilizations in Afroeurasia and the Americas, post-classical empires and cross-cultural exchange, technology and environmental change, the Mongol Empire, and oceanic voyages and the origins of the modern world.","re":null,"com":[],"sec":[]},"71668":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Examines major world issues over the past 500 years. Topics include European expansion and colonialism, the Muslim empires, East Asia from Ming to Qing, the Americas, Africa, the scientific-technological revolution, decolonization, and modern environmental problems. Designed primarily for first- and second-year students, it provides a time frame for understanding events within a global framework.","re":null,"com":[],"sec":[]},"71669":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"A survey of economic, social, and political history of Europe since the late 15th century: 1500–1789. A is not prerequisite to B, nor B to C. (Formerly","re":null,"com":[],"sec":[]},"71670":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Analyzes immigration, race relations, war, gender ideology, family life, acculturation, political activism, interracial marriage, multiracial identity, and cultural representations between 1941 and the present. Emphasis on discussion, writing, research, and group presentations.","re":null,"com":[],"sec":[]},"71671":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the history of work, working-class people, and the labor movement in the U.S., with attention to race and gender dynamics as well as to the development of workers' organizations.","re":null,"com":[],"sec":[]},"71672":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Covers the social, cultural, economic, and political history of colonial Mexico (New Spain). Special attention paid to colonial identity formation, religion, and labor systems. Begins by examining indigenous societies prior to the arrival of Europeans and concludes with Mexico's independence movement in the early 19th century. (Formerly","re":null,"com":[],"sec":[]},"71673":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduces students to how Qing China arose, expanded, and struggled to enter the modern world. Focuses on what the Qing empire had in common with other agrarian empires across Eurasia, commercialization and communication networks, elite mobility and peasant revolts, political legitimacy of the alien rule, maintaining social order (such as merchants' control and gender segregation), massive population growth and internal migration, as well as its conflicts with the industrial West.","re":null,"com":[],"sec":[]},"71674":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Introduces processes involved in the construction of global modernity via the history of colonization, anticolonial resistance, decolonization, nationalism, and nation-state building. Bound up in these processes are important theoretical issues of knowledge production, secularism, and the nature of sovereignty.","re":null,"com":[],"sec":[]},"71675":{"ty":"Lecture","cr":"5","ge":["IS","E"],"desc":"Interdisciplinary introduction presenting the elements for studying Latin American culture, society, economics, and politics, as well as the dynamics of Latino communities in the U.S. Special attention paid to issues of race, gender, and class, to emerging political and economic shifts in the Americas, and to new local and transnational efforts for social change on the part of Latin America's peoples and Latinos in the U.S.","re":null,"com":[],"sec":[]},"71676":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Focuses on: transnational migrations; social inequalities; collective action and social movements; and cultural productions, products, or imaginaries. Examines how transnational migration and hemispheric integration are transforming Latin American studies and Chicana/o-Latina/o studies. Explores the influence of neoliberalism and globalization, especially the intersection of critical analysis and social-justice praxis.","re":null,"com":[],"sec":[]},"71677":{"ty":"Lecture","cr":"5","ge":["T3-SocialSciences","E"],"desc":"Focuses on politics of power and resistance regarding major cross-border issues facing Latin Americans and Latinos in the 21st century. Emphasizes migration and migrant organizing; neoliberal \"free trade\" and implications for labor; organizing by women's, indigenous, and ecological movements; and for democracy and human rights. Many specific cases drawn from binational Central American experiences.","re":null,"com":[],"sec":[]},"71678":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines current problems in law as it intersects with politics and society. Readings are drawn from legal and political philosophy, social science, and judicial opinions.","re":".","com":[],"sec":[]},"71679":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to constitutional law, emphasizing equal protection and fundamental rights as defined by common law decisions interpreting the 14th Amendment, and also exploring issues of federalism and separation of powers. Readings are primarily court decisions; special attention given to teaching how to interpret, understand, and write about common law.","re":".","com":[],"sec":[]},"71680":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to comparative and historical analyses of the relations between race and criminal justice in the U.S. Emphasis on examinations of structural mechanisms that help maintain and perpetuate racial inequality in law, criminal justice, and jury trials.","re":".","com":[],"sec":[]},"71681":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores the legal rights of children. Topics may include juvenile justice, gang offenses, free speech and Internet censorship, religious rights, child custody and support, adoption, foster care, abuse and sexual harassment, special needs, public benefits, and medical care.","re":".","com":[],"sec":[]},"71682":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores some aspects of early American constitutional thought, particularly immediately preceding the American Revolution situating early colonial constitutional thought within some of the larger themes and controversies of the 17th-century English constitutionalism, then considering some aspects of American constitutional thought in the founding period against the background of the colonial experience. Prerequisite(s): permission of instructor: selection based on the ability to do very advanced work. Enrollment restricted to legal studies majors during priority period.","re":null,"com":[],"sec":[]},"71683":{"ty":"Lecture","cr":"5","ge":["IH","W"],"desc":"Close reading and analysis of literary texts, including representative examples of several different genres and periods. An introduction to practical criticism required of all literature majors; should be completed prior to upper-division work in literature.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71684":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Close reading of short stories and some novels with the aim of developing critical methods for the analysis and interpretation of prose fiction. Topics include character, plot, narrative structure, and the poetics of prose.","re":null,"com":[],"sec":[]},"71685":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts"],"desc":"Study of representative plays. No previous experience with Shakespeare is assumed.","re":null,"com":[],"sec":[]},"71687":{"ty":"Lecture","cr":"5","ge":[],"desc":"Considers the ways that waging, preparing for, recovering from, and grappling with modern warfare has influenced 20th-century American culture. Introduces key aspects of 20th-century American literature: modernism; noir; the gothic; New Journalism; postmodern narrative. Satisfies the English and Modern Literature concentrations.","re":null,"com":[],"sec":[]},"71688":{"ty":"Seminar","cr":"5","ge":[],"desc":"Intensive examination of issues in U.S. literature. Topic for Summer 2008: Southern Fiction—Lonely Hearts. Satisfies the English and Modern Literature concentrations; also satisfies the Senior Seminar distribution requirement. May be repeated for credit.","re":"Literature 101. Enrollment restricted to senior literature majors.","com":[],"sec":[]},"71689":{"ty":"Lecture","cr":"5","ge":[],"desc":"Survey of 20th-century Soviet literature, from the revolution to the death of Stalin. Readings include modernist and avant-garde texts of the 1920s and socialist realism. Satisfies the Modern and World Literature concentrations; also satisfies the Global distribution requirement. (Formerly","re":null,"com":[],"sec":[]},"71690":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduces selected modes and forms of poetry with emphasis on close textual analysis. Considers uses of Greek and Roman antiquity in English/Anglo-American poetic practice from early to post-modernity by historicizing the reproduction of antiquity through poetic forms. Satisfies the Pre- and Early Modern Concentration; also satisfies the Poetry and the Pre- and Early Modern Distribution requirements.","re":null,"com":[],"sec":[]},"71691":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Study of literature of the Asian diaspora, attempting to discover and define a growing body of contemporary writing under this rubric, including immigrant/migrant histories, memories of exile and refuge, as well as the fiction of imagined homelands. Topic for summer 2008: recent texts reflecting on the complexities, ambivalencies, and unsettledness of living in between home and abroad.","re":null,"com":[],"sec":[]},"71692":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"Introductory study of the Hollywood music film, exploring the theory of film sound, the musical genre, and representative works from the 1920s to the present. Students expected to view about two films each week, read assigned section of texts, and contribute to class discussions.","re":null,"com":[],"sec":[]},"71693":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides opportunity to assess and revise methods of and purposes in studying. Critical, effective approaches to reading, writing, participating in lectures and sections, taking exams, balancing competing responsibilities, and utilizing campus resources explored. Enrollment by permission of college adviser.","re":null,"com":[],"sec":[]},"71694":{"ty":"Lecture","cr":"5","ge":["T2-NaturalSciences"],"desc":"The ecology of plants and animals in oceans and coastal areas. Consideration of life in various marine habitats, including the open ocean, rocky shores, estuaries, and the sea. Includes field trips. High school biology and chemistry courses are recommended prior to taking this course.","re":null,"com":[],"sec":[{"num":"71768","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"09:30","end":"10:50"}},"loc":"Earth&Marine D266"}],"ins":"Gong,A.","cap":"22"}]},"71695":{"ty":"Lecture","cr":"5","ge":[],"desc":"In-depth analysis of philosophical aspects of Shakespeare's plays, including those performed at the Shakespeare Santa Cruz festival in the summer of 2008.","re":"course 91, 93, or 94. Prerequistes waived for non-UCSC students.","com":[],"sec":[]},"71696":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6B. One three-hour laboratory session per week.","re":"courses 5A/L or 6A/L; concurrent enrollment in course 6B required. Prerequisite(s): courses 5A/L or 6A/L; concurrent enrollment in course 6B required. Prerquisites waived for non-UCSC students.","com":[],"sec":[]},"71697":{"ty":"Laboratory","cr":"5","ge":[],"desc":"Demonstration of phenomena of classical and modern physics. Development of a familiarity with experimental methods. Special experimental projects may be undertaken by students in this laboratory.","re":"course 101A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71698":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Analysis of the development and operation of American political institutions, focusing on the constitutional powers of the Congress, presidency, and Supreme Court; and the evolution of the American system of political parties. Topics include the ideological underpinnings of American democracy; the changing balance of power between the executive, legislative, and judicial branches; the expansion of national government power; the expansion of the right to vote and political representation; and the rising power of \"non-governmental\" forces.","re":null,"com":[],"sec":[]},"71699":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Examines role of ideas, interests, and institutions in shaping contemporary social policy in the U.S. Focuses on political struggles and policy debates in the areas of crime and drug control, health care, and income security.","re":null,"com":[],"sec":[]},"71700":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"Introduces music to the study of politics. Considers the fields of music and identity; music and social movements; and theories of music, art, and revolution.","re":null,"com":[],"sec":[]},"71701":{"ty":"Lecture","cr":"5","ge":["IS"],"desc":"From September 2001 the U.S. committed to a \"War on Terrorism.\" What are its political sources? Objectives? Effects on internal politics, external alliances, and civil liberties? Military implications? Costs? How is political discourse deployed? How can it be assessed?","re":null,"com":[],"sec":[]},"71702":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines current problems in law as it intersects with politics and society. Readings are drawn from legal and political philosophy, social science, and judicial opinions.","re":".","com":[],"sec":[]},"71703":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to constitutional law, emphasizing equal protection and fundamental rights as defined by common law decisions interpreting the 14th Amendment, and also exploring issues of federalism and separation of powers. Readings are primarily court decisions; special attention given to teaching how to interpret, understand, and write about common law.","re":".","com":[],"sec":[]},"71704":{"ty":"Lecture","cr":"5","ge":["E"],"desc":"Overview of major approaches to the study of Latin American politics. Introductory survey of historical and contemporary democratic, populist, authoritarian, and revolutionary regimes. Special attention to local, national, and global forces shaping development strategies and public policies; changing institutional arrangements and shifting discourses of domination; and social movements and strategies of resistance among subaltern social groups and classes. Students cannot receive credit for this course and course 241.","re":".","com":[],"sec":[]},"71705":{"ty":"Lecture","cr":"2","ge":["A"],"desc":"Focuses on filmmakers and monologue performers as they come to terms with their identity in autobiographical works. Students write responses to texts and create their own brief personal narratives.","re":null,"com":[],"sec":[]},"71706":{"ty":"Lecture","cr":"5","ge":["Q"],"desc":"An introduction to elementary statistical principles and techniques relevant to psychological research. Topics covered include basic parametric and nonparametric statistics, analysis of variance, and simple factorial designs. This course is prerequisite to course 181.","re":"course 1, and Applied Mathematics and Statistics 3 or Mathematics 3 or 11A or satisfactory placement score on math placement exam or CEEB Advanced Placement Calculus AB exam. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71707":{"ty":"Lecture","cr":"5","ge":[],"desc":"Cognition in children from infancy through adolescence. Basic and current research on children's understanding of the social and physical world. Focus on major theoretical perspectives: Piaget's constructivist approach, information processing approach, and sociocultural approach.","re":"courses 3 and 10. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71708":{"ty":"Lecture","cr":"5","ge":[],"desc":"An examination of the physiological mechanisms of psychological processes, including sensory systems, motor systems, control systems, and memory and learning. Principles of nervous system organization are discussed at each level.","re":"course 1 or Biology 70 and one course in statistics (course 2 or Applied Mathematics and Statistics 5 or 7). Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71710":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduction to how evolutionary principles can help us understand origins of the human mind. Covers evolutionary approaches to cognitive, social, and developmental psychology with emphasis on how cognition has been shaped by natural selection.","re":"course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71711":{"ty":"Lecture","cr":"5","ge":[],"desc":"Considers interpersonal and societal influences on people's gender-stereotyped expectations and behavior in close relationships, the family, schools, and the workplace. Also examines power and status inequalities between women and men in social interactions and society. Related topics may include gender in the media, body image and self-concept, interpersonal communication, and violence.","re":"courses 3 and 40. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71712":{"ty":"Lecture","cr":"5","ge":[],"desc":"A systematic analysis of the social and contextual determinants of human behavior, with special attention given to concepts of  situational control, social comparison, role and attribution theories, as well as the macrodeterminants of behavior: cultural, historical, and sociopolitical context.","re":"courses 3 and 40 or Sociology 136. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71713":{"ty":"Seminar","cr":"5","ge":[],"desc":"Why do some situations seem fair and others unfair? Are all people concerned with justice or are some scoundrels? This course looks at the principles of distributive, procedural, and retributive justice and at real world applications of theories. Satisfies seminar requirement. Satisfies senior comprehensive requirement.","re":"Enrollment restricted to senior psychology majors.","com":[],"sec":[]},"71714":{"ty":"Lecture","cr":"5","ge":[],"desc":"The psychology of organized human interaction: individual motivation; social perception; leadership and participation; group, intergroup, and system dynamics; conflict and conflict resolution; cooperation and decision-making. Also considers contemporary issues facing American organizations.","re":"course 3. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71715":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Introduction to graphite, pen and ink, coquille, and scratchboard, along with training in essential skills for creating accurate and dynamic scientific illustrations. Attention to the demands of the printing process along with basics of proportion, perspective, and composition. Appropriate for students with a demonstrated interest in science illustration through previous course work in science and art, or through extracurricular activity in the field, or a strong desire to learn the skills of the field. Enrollment process differs for Summer Session. May be repeated for credit.","re":null,"com":[],"sec":[]},"71716":{"ty":"Studio","cr":"5","ge":["A"],"desc":"Explores science illustration relating to marine subjects and their environment, using watercolor and mixed-media techniques. Current illustration styles and conventions are covered, emphasizing making marine science accessible to everyone. No prior art or science experience necessary.","re":null,"com":[],"sec":[]},"71717":{"ty":"Lecture","cr":"5","ge":[],"desc":"Surveys major theoretical perspectives currently available in the discipline including functionalism, symbolic interactionism, ethnomethodology, conflict theory, critical theory, neo-Marxism, feminist theory.","re":".","com":[],"sec":[]},"71718":{"ty":"Lecture","cr":"5","ge":[],"desc":"Focuses on the interaction between family and society by considering the historical and social influences on family life and by examining how the family unit affects the social world. Readings draw on theory, history, and ethnographic materials.","re":null,"com":[],"sec":[]},"71719":{"ty":"Lecture","cr":"5","ge":[],"desc":"An intensive examination of major substantive monographs representing pluralist, elite, and class theories of the state in industrialized capitalist democracies.","re":null,"com":[],"sec":[]},"71720":{"ty":"Lecture","cr":"5","ge":[],"desc":"An introduction to comparative and historical analyses of the relations between race and criminal justice in the U.S. Emphasis on examinations of structural mechanisms that help maintain and perpetuate racial inequality in law, criminal justice, and jury trials.","re":".","com":[],"sec":[]},"71721":{"ty":"Lecture","cr":"5","ge":[],"desc":"Why certain social acts are considered threatening and how individuals or groups become stigmatized. Sociological analysis of the institutions and processes of social control and the experience of becoming deviant and living with a stigmatized identity. Introductory course in sociology recommended.","re":null,"com":[],"sec":[]},"71722":{"ty":"Lecture","cr":"5","ge":[],"desc":"Modern society not only assaults nature, it does so in ways that reproduce existing social inequalities. Reviews research on disproportionate exposure to risks and hazards, especially along dimensions of  class and race, and examines the environmental justice movement.","re":".","com":[],"sec":[]},"71723":{"ty":"Studio","cr":"5","ge":["T4-HumanitiesandArts","A"],"desc":"Theory and practice of improvisation in the performing arts with an emphasis on acting improvisation techniques. Readings and films develop a theoretical and historical understanding of spontaneous invention on stage. Students attend area theater improvisational performances.","re":null,"com":[],"sec":[]},"71724":{"ty":"Seminar","cr":"3","ge":[],"desc":"Offers instruction on selected topics in grammar and conventions of written English as needed to strengthen the writing skills of students whose primary language is not standard English. Provides students practice in applying these concepts to editing their own writing. Designed for continuing students who have already taken course 20 and/or 21.","re":null,"com":[],"sec":[]},"71725":{"ty":"Seminar","cr":"2","ge":[],"desc":"Weekly seminar designed to present students with current working applications in various fields of applied economics and finance. May be repeated for credit.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71726":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Develops rhetorical facility in disciplinary writing for upper-division social science majors. Requires critical and disciplinary reading, writing in modes appropriate to social science disciplines, and a substantial research or critical paper within the student's own discipline.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71727":{"ty":"Seminar","cr":"5","ge":[],"desc":"Students learn strategies to write, analyze, and deliver effective speeches of various kinds as well as professional presentations using PowerPoint and other visuals.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71728":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Introduces students to the various forms of magazine writing, as well as to pertinent reporting techniques. Students work intensively on process, style, and editing, producing numerous formal and informal pieces. Enrollment priority will be given to journalism minors. Students produce a writing sample on the first day of class. Prerequisite(s): satisfaction of Entry Level Writing and Composition requirements; course 64 or permission of instructor.","re":null,"com":[],"sec":[]},"71729":{"ty":"Seminar","cr":"5","ge":[],"desc":"Highlights important, relevant, and topical themes in American studies and society. By closely examining one topic or theme, students connect larger issues and think across areas of study. Topics include: the prison industrial complex; radical traditions in America; race and cultural exchange; and citizenship in America. May be repeated for credit.","re":null,"com":[],"sec":[]},"71730":{"ty":"Lecture","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences"],"desc":"Introduces key concepts and debates around topics such as political economy, nationalism, globalization, citizenship, class, and social movements and addresses their importance to American studies. Examines these issues through attention to political theory, social transformations, and cultural representations.","re":null,"com":[],"sec":[]},"71731":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Provides biology majors with the theory and practice of experimental biology. A wide range of concepts and techniques used in the modern laboratory are included in the exercises. Designed to satisfy the introductory biology lab requirement of many medical and professional schools. Students are billed a materials fee.","re":"course 20A and previous or concurrent enrollment in 20B. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71732":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Provides biology majors with the theory and practice of experimental biology. A wide range of concepts and techniques used in the modern laboratory are included in the exercises. Designed to satisfy the introductory biology lab requirement of many medical and professional schools. Students are billed a materials fee.","re":"course 20A and previous or concurrent enrollment in 20B. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71733":{"ty":"Studio","cr":"2","ge":["A"],"desc":"Hands-on introduction to computer music. Students encounter a broad spectrum of techniques drawn from the history of electroacoustic music and apply them through regular programming/composition assignments. No previous experience with computer programming is assumed.","re":null,"com":[],"sec":[]},"71734":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examines history of food in world history and its interactions from the beginnings of sedentary agriculture in the Fertile Crescent to the present.","re":null,"com":[],"sec":[]},"71735":{"ty":"Lecture","cr":"5","ge":[],"desc":"Offers systematic exploration of alternative conceptions of the nature of law, including positivism, natural law, formalism, realism, pragmatism, and theories of justice. Additional focus on the nature of law; relation of law and morality, rights and other legal concepts; and philosophical debates such as critical legal studies and critical race theory.","re":".","com":[],"sec":[]},"71736":{"ty":"Lecture","cr":"5","ge":[],"desc":"A review of methods of psychotherapy, with attention to the underlying assumptions about personality, health, and disease.","re":"course 3; course 60 or 170 recommended. Prerequisite(s): course 3; course 60 or 170 recommended. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71737":{"ty":"Lecture","cr":"5","ge":[],"desc":"Speaking, listening comprehension, reading and writing fundamentals. Taught entirely in Spanish; conversational fluency is encouraged through classroom practice and conversation groups, and is supplemented by language laboratory work. Classes are held three days a week; students complete the conversation group work independently of the classroom sessions.","re":"course 2, 2X, or Spanish Placement Examination score of 30.","com":[],"sec":[]},"71738":{"ty":"Seminar","cr":"5","ge":["IH"],"desc":"Includes comprehensive grammar review, composition, readings, and discussion. Reading and audiovisual material deal with various sociopolitical and cultural issues in the Spanish speaking world. Classes are conducted in Spanish.","re":"course 3, 3T, 3X, or Spanish Placement Examination score of 40.","com":[],"sec":[]},"71739":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Includes comprehensive grammar review, composition, readings, and discussion. Reading and audiovisual material deal with various socio-political and cultural issues in the Spanish speaking world. Classes are conducted in Spanish.","re":"course 4, 4X, or Spanish Placement Examination score of 50.","com":[],"sec":[]},"71740":{"ty":"Lecture","cr":"5","ge":["IH"],"desc":"Students learn vocabulary, expressions, and cultural background to be able to interact with Spanish-speaking patients and doctors. Medical Spanish fulfills language requirement for the health science major of the Biology Department.","re":"course 4; or Spanish for Spanish Speakers 61, 62, and 63; or Spanish for Spanish Speakers 125; or Spanish Placement Examination score of 50 or higher. Enrollment restricted to health sciences majors.","com":[],"sec":[]},"71741":{"ty":"Seminar","cr":"5","ge":["W"],"desc":"Introduces students to the dilemmas of science-based environmental policy and discusses their underlying philosophical underpinnings. Explores emergent alternatives, such as the precautionary principle and alternatives assessment, and examines the relationship between experts and the lay public in public controversies.","re":"satisfaction of the Entry Level Writing and Composition requirements. Prerequisite waived for non-UCSC students.","com":[],"sec":[]},"71742":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores histories of U.S. mass education; theories of identity and educational inequality; and popular representations of schools. Considers current educational conditions in California, as well as the potential role of schools in social justice struggles.","re":null,"com":[],"sec":[]},"71743":{"ty":"Lecture","cr":"5","ge":[],"desc":"Explores intersections of popular culture and public spaces; how public spaces structure our lives and experiences, and how we interact with and come to understand popular culture; and how social histories, customs, and values influence the creation and maintenance of public spaces.","re":null,"com":[],"sec":[]},"71744":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Examines selected alternative documentary movements and their corresponding social politics, including the British Documentary movement, Cinéma Vérité American Direct Cinema, feminist counter cinema, and the contemporary self-reflexive documentary explosion.","re":null,"com":[],"sec":[]},"71745":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts","A","E"],"desc":"Introduces basic concepts of ethnomusicology; instructs students in the development of listening and analytical skills; and explores selected musical areas of East Asia, Southeast Asia, and South Asia.","re":null,"com":[],"sec":[]},"71746":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71747":{"ty":"Seminar","cr":"5","ge":["C"],"desc":"A basic composition course, which helps students find specific, practical ways of improving every aspect of their writing, through a broadly based consideration of the nature of language from a diversity of perspectives.","re":"satisfaction of the Entry Level Writing requirement.","com":[],"sec":[]},"71748":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71749":{"ty":"Seminar","cr":"5","ge":["C2"],"desc":"Explores the intersections of investigation, interpretation, and persuasion and hones strategies for writing and research. Students develop specific, practical ways of improving their writing through sustained critical thinking about diverse issues from multiple points of view. Students cannot receive credit for this course and course 1.","re":"satisfaction of the Entry Level Writing and C1 requirements.","com":[],"sec":[]},"71750":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71751":{"ty":"Seminar","cr":"5","ge":[],"desc":"Explores the dynamics of written language: its relationships to speech, thought, and culture; its uses in different personal, academic, professional, and public contexts; its abuses in jargon and propaganda. Course work includes extensive practice in different kinds of writing. Enrollment restricted to students who have not passed the Entry Level Writing Requirement. Open to others by permission of instructor.","re":null,"com":[],"sec":[]},"71752":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of income, employment, interest rates, and the price level. Examines the role of monetary and fiscal policy in economic stabilization. Also considers these issues as they relate to the global economy. Students cannot receive credit for this course and course 100N.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Course 100A is strongly recommended as preparation. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71753":{"ty":"Lecture","cr":"5","ge":[],"desc":"Covers major theoretical issues arising in the study of resource allocation, the function of markets, consumer behavior, and the determination of price, output, and profits in competitive, monopolistic, and oligopolistic market structures. Also considers issues of welfare and public policy. Students cannot receive credit for this course and course 100M.","re":"courses 1, 2, and 11A or Applied Mathematics and Statistics 11A or Mathematics 11A or 19A. Prerequisites waived for non-UCSC students.","com":[],"sec":[]},"71754":{"ty":"Lecture","cr":"5","ge":["A"],"desc":"Develops visual-literacy skills and increases students' critical analysis of photographic content within the social documentary genre. Through reading, writing, lectures, and web site screenings, students focus on the role of photography in describing society.","re":null,"com":[],"sec":[]},"71755":{"ty":"Seminar","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences"],"desc":"Focuses on interdisciplinary feminist reworkings of scientific models of human animal social interactions. Examines primate social interactivities and domestic and companion animals in relation to feminist scientific practices and philosophies. Considers how creative re-vision of human-animal and human-human relations can work as feminist interventions.","re":null,"com":[],"sec":[]},"71756":{"ty":"Seminar","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences"],"desc":"Using feminist ethnography, introduces a variety of ways in which gender and sexuality are made, practiced, and written about. Analyzes what constitutes gender. Topics include the category \"transgender\" and transsexual narratives of sex/gender transformation, sexuality and public culture, and the erotic economies of sex work.","re":null,"com":[],"sec":[]},"71757":{"ty":"Lecture","cr":"5","ge":[],"desc":"Examination of Shakespeare's","re":null,"com":[],"sec":[]},"71758":{"ty":"Lecture","cr":"5","ge":[],"desc":"Paradigms and designs in marine ecology.  A review of the paradigms that have shaped our understanding of marine ecology; analysis and discussion of experiments with these paradigms. Students cannot receive credit for this course and course 260.","re":"courses 20A, 20B, and 20C; course 140 or 150 recommended.","com":[],"sec":[]},"71759":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides student and faculty adviser with time to confer over the completion of the required portfolio.","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71760":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6C. One three-hour laboratory session per week.","re":"courses 6A/L or 5A/L; concurrent enrollment in course 6C required; courses 6B/M are suggested.","com":[],"sec":[]},"71761":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71762":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71763":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71764":{"ty":"Seminar","cr":"5","ge":[],"desc":"Supervision of Ed.D. candidate through third year of research analysis, writing, and editing of dissertation. Preparation for oral defense and assistance with bringing dissertation to standards of publication and conference presentation.","re":"Enrollment restricted to Ed.D. graduate students.","com":[],"sec":[]},"71766":{"ty":"Lecture","cr":"2","ge":[],"desc":"Addresses the preparation of teachers for creating a supportive, healthy environment for student learning. Covers topics related to physical, emotional, and social health. (Formerly","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71767":{"ty":"Lecture","cr":"2","ge":[],"desc":"Addresses the preparation of teachers for creating a supportive, healthy environment for student learning. Covers topics related to physical, emotional, and social health. (Formerly","re":"Enrollment restricted to graduate students.","com":[],"sec":[]},"71769":{"ty":"Lecture","cr":"5","ge":[],"desc":"Introduces the long-standing question in philosophical and literary studies: the relationship of philosophy to poetry. Surveys a range of perspectives, from classical treatises to contemporary debates. Examines how this relationship has been articulated by philosophers and poets.","re":"Enrollment restricted to juniors and seniors.","com":[],"sec":[]},"71771":{"ty":"Lecture","cr":"5","ge":["W"],"desc":"A study of human communication as a function of psychological, linguistic, and social factors. Topics covered include language comprehension and production, language and reasoning, and language as a social activity.","re":"satisfaction of the Entry Level Writing and Composition requirements; course 3 or 20 or Linguistics 52 or 53 or 55.","com":[],"sec":[]},"71772":{"ty":"Lecture","cr":"5","ge":["T5-HumanitiesandArtsorSocialSciences"],"desc":"Drawing on several fields of knowledge, especially science studies, cultural studies, and design studies, course aims to awaken students to the often invisible impact of everyday choices.","re":null,"com":[],"sec":[]},"71773":{"ty":"Lecture","cr":"2","ge":[],"desc":"Focuses on three intriguing topics that philosophers have considered when they have reflected on film. The course inquires about 1) the nature of film; 2) film and narration; and 3) the relationship between film and philosophy. Students examine these topics through readings from philosophers, film theorists, movie critics, and required screenings of films.","re":null,"com":[],"sec":[]},"71774":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts"],"desc":"Systematic investigation of the development of philosophical perspectives on sexuality from ancient times to the 21st century. Topics include prostitution, homosexuality, perversion, promiscuity/monogamy, pornography, feminism, and sexual morality.","re":null,"com":[],"sec":[]},"71775":{"ty":"Lecture","cr":"5","ge":["T4-HumanitiesandArts"],"desc":"Exploration of the philosophy of film through the viewing and discussion of philosophically interesting films. Students examine the aesthetics of film and the variety of philosophical issues as particular films raise them.","re":null,"com":[],"sec":[]},"71777":{"ty":"Seminar","cr":"2","ge":[],"desc":"Provides opportunity to assess and revise methods of and purposes in studying. Critical, effective approaches to reading, writing, participating in lectures and sections, taking exams, balancing competing responsibilities, and utilizing campus resources explored. Enrollment by permission of college adviser.","re":null,"com":[],"sec":[]},"71778":{"ty":"Laboratory","cr":"1","ge":[],"desc":"Laboratory sequence illustrating topics covered in course 6A. One three-hour laboratory session per week.","re":"Concurrent enrollment in course 6A required.","com":[],"sec":[]},"71779":{"ty":"Laboratory","cr":"2","ge":[],"desc":"Laboratory sequence illustrating topics covered in courses 1B-1C, respectively, and important experimental techniques. Laboratory: 3 hours; lecture: 1-1/4 hours. Students are billed a materials fee. Course 1M offered in winter 2008 and spring 2008; 1N offered in spring 2008 and fall 2008.","re":"course 1M. Concurrent enrollment in course 1C is required. Prerequisites waived for non-UCSC students.","com":[],"sec":[{"num":"70307","sec":"01A","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"15:00"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"70308","sec":"01B","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"12:00","end":"15:00"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"},{"num":"71765","sec":"01C","loct":[{"t":{"day":["Tuesday","Thursday"],"time":{"start":"15:30","end":"18:30"}},"loc":"TBA"}],"ins":"Roland,R.E.","cap":"18"}]},"71794":{"ty":"Independent Study","cr":"5","ge":[],"desc":"Individual, directed study for lower-division students in expository writing, editing, or journalism. Students submit petition to sponsoring agency. May be repeated for credit.","re":null,"com":[],"sec":[]},"71795":{"ty":"Field Studies","cr":"7","ge":[],"desc":"Provides a fundamental understanding of renewable energies in practice by experiencing them in a functional context. Students visit and evaluate renewable-energy facilities, such as wind power, solar energy, hydrogen storage, biofuel production, waste-water testing facilities, biomass, biodiesel, and biogas. This intensive one-month program allows students to carry out applied research in a real-life, industrial-scale, renewable-energy context. Prerequisite(s): course 80J or equivalent. Enrollment restricted to junior, senior, and graduate students and by permission of instructor.","re":null,"com":[],"sec":[]}}